{"clue": "Find record above (8)", "orientation": "down", "quick": true, "input": "**Clue**: Find record above (8)\n**Orientation**: down", "explanation": "**Clue**: Find record above (8)\n**STEP 1**: \nWe will start by identifying the type of the puzzle. We cannot find any indicators for this clue, we assume that it is a Charade (additive) type of puzzle. That means we need to find wordplay words from words or phrases in the clue, and concatenate the wordplay words together. \n**STEP 2**: \nWe will then find the definition. Since the definition is almost always either at the beginning or end of the clue sentence or phrase, it could be that either “find” or “above” is the definition, In fact it is “FIND”. \n**STEP 3**: \nWe will look at the word length of the answer. The enumeration suggests that the answer will be one word that is 8 letters long. \n**STEP 4**: \nWe will solve the puzzle by following the plan we made in STEP 1: since it’s a Charade type puzzle, we will try to find the wordplay words that each phrase in the puzzle cues. \nIt's still not quite clear what the answer can be. Let’s think from another direction: If we think about it:\n1. The answer is synonym of  “FIND” \n2. The answer is one word with 8 letters\nwe would think about the word “DISCOVER”. And indeed, “RECORD” reasonably cues “DISC”, and “ABOVE” reasonably cues “OVER”. If we put the wordplay words “DISC” and “OVER” together, we will get the word “DISCOVER”.\n**STEP 5**:  \nWe will check if the answer we found is correct. FIRST, it fits the enumeration, because “DISCOVER” is indeed one word with 8 letters. SECOND, the word “DISCOVER” is a meaningful word and fits the definition “FIND”. \nSo the answer is **DISCOVER**"}
{"clue": "Church house in earlier years (6)", "orientation": "across", "quick": true, "input": "**Clue**: Church house in earlier years (6)\n**Orientation**: across", "explanation": "**Clue**: Church house in earlier years (6)\n**STEP 1**: \nWe will start by identifying the type of the puzzle. We cannot find any indicators for this clue, we assume that it is a Charade (additive) type of puzzle. That means we need to find wordplay words from words or phrases in the clue, and concatenate the wordplay words together. \n**STEP 2**:  \nWe will then find the definition.Since the definition is almost always either at the beginning or end of the clue sentence or phrase, we will assume “CHURCH HOUSE” is the definition.  \nWe noticed that there is a commonly used linkword: “IN”. \n**STEP 3**: \nWe will look at the word length of the answer. The enumeration suggests that the answer will be one word that is 6 letters long. \n**STEP 4**: \nWe will solve the puzzle by following the plan we made in STEP 1: since it’s a Charade type puzzle, we will try to find the wordplay words that each phrase in the puzzle cues. Since “CHURCH HOUSE” is the definition followed by the linkword “IN”, we will look at the rest of the clue: “EARLIER” might cues “PRIOR”. \nIt's still not quite clear what the answer can be. Let’s think from another direction: If we think about it:\n1. The answer is synonym of  “CHURCH HOUSE” \n2. The answer is one word with 8 letters\n3. The answer starts with “PRIOR”,\nwe would think about the word “PRIORY”. And indeed, “YEARS” reasonably cues “Y” (Abbreviation). If we put the wordplay words “PRIOR” and “Y” together, we will get the word “PRIORY”.\n**STEP 5**:  \nWe will check if the answer we found is correct. FIRST, it fits the enumeration, because “PRIORY” is indeed one word with 6 letters.  SECOND, The word “PRIORY” is a meaningful word and fits the definition “CHURCH HOUSE”. \nSo the answer is **PRIORY**"}
{"clue": "Puzzle failing in China (3, 7)", "orientation": "down", "quick": true, "input": "**Clue**: Puzzle failing in China (3, 7)\n**Orientation**: down", "explanation": "**Clue**: Puzzle failing in China (3, 7)\n**STEP 1**: \nWe will start by identifying the type of the puzzle. We cannot find any indicators for this clue, we assume that it is a Charade (additive) type of puzzle. That means we need to find wordplay words from words or phrases in the clue, and concatenate the wordplay words together. \n**STEP 2**:  \nWe will then find the definition. Since the definition is almost always either at the beginning or end of the clue sentence or phrase, we will assume “CHINA” is the definition. \nWe noticed that there is a commonly used linkword: “IN”. \n**STEP 3**: \nWe will look at the word length of the answer. The enumeration suggests that the answer will be two words, the first word is 3 letters long and the second word is 7 letters long. So in total, there are 10 letters. \n**STEP 4**: \nWe will solve the puzzle by following the plan we made in STEP 1: since it’s a Charade type puzzle, we will try to find the wordplay words that each phrase in the puzzle cues. Since “CHINA” is the definition, and there is the linkword “IN”, we will look at the rest of the clue: “PUZZLE” might cue “TEASER”. \nIt's still not quite clear what the answer can be. Let’s think from another direction:  if we think about it:\n1. The answer is  synonym of “CHINA” \n2. The answer is two words, the first word is 3 letters long and the second word is 7 letters long\n3. The answer starts with “TEASER”, or “TEA SER” since it’s (3, 7)\n we would think about the word “TEA SERVICE”. And the “VICE” in “TEA SERVICE” is reasonably cued by “FAILING”. If we put the wordplay words “TEASER” and “VICE” together, we will get the word “TEASERVICE”, and we can rearrange it according to the enumeration to get “TEA SERVICE” (3, 7).\n**STEP 5**:  \nWe will check if the answer we found is correct. FIRST, it fits the enumeration, because “TEA SERVICE” is indeed 10 letters that can be broken into (3, 7).  SECOND, The word “TEA SERVICE” is a meaningful word and fits the definition “CHINA”. \nSo the answer is **TEA SERVICE**"}
{"clue": "What babies need is sleep and food (7)", "orientation": "across", "quick": true, "input": "**Clue**: What babies need is sleep and food (7)\n**Orientation**: across", "explanation": "**Clue**: What babies need is sleep and food (7)\n**STEP 1**: \nWe will start by identifying the type of the puzzle. We cannot find any indicators for this clue, we assume that it is a Charade (additive) type of puzzle. That means we need to find wordplay words from words or phrases in the clue, and concatenate the wordplay words together. \n**STEP 2**:  \nWe will then find the definition. Since the definition is almost always either at the beginning or end of the clue sentence or phrase, we will assume “WHAT BABIES NEED” is the definition. We noticed that there is a commonly used linkword: “IS”. The linkword “IS” suggests that the answer, a synonym to the definition, can be formed from the rest of the clue. \n**STEP 3**: \nWe will look at the word length of the answer. The enumeration suggests that the answer will be one word that is 7 letters long. \n**STEP 4**: \nWe will solve the puzzle by following the plan we made in STEP 1: since it’s a Charade type puzzle, we will try to find the wordplay words that each phrase in the puzzle cues. Since “WHAT BABIES NEED” is the definition, and there is the linkword “IS”, we will look at the rest of the clue:  Here we find another commonly used linkword: “AND“. “AND” should indicate the linkage within the wordplay. “SLEEP” might cue “NAP”. \nIt's still not quite clear what the answer can be. Let’s think from another direction:  if we think about it:\n1. The answer is “WHAT BABIES NEED” \n2. The answer starts with “NAP”,\n3. The answer is one word with 7 letters\n we would think about the word “NAPPIES”. And the “PIES” in “NAPPIES” is reasonably cued by “FOOD”. If we put the wordplay words “NAP” and “PIES” together, we will get the word “NAPPIES”.\n**STEP 5**:  \nWe will check if the answer we found is correct. FIRST, it fits the enumeration, because “NAPPIES” is indeed one word with 7 letters.  SECOND, The word “NAPPIES” is a meaningful word and fits the definition “WHAT BABIES NEED”. \nSo the answer is **NAPPIES**"}
{"clue": "President saw nothing wrong(10)", "orientation": "down", "quick": true, "input": "**Clue**: President saw nothing wrong(10)\n**Orientation**: down", "explanation": "**Clue**: President saw nothing wrong(10)\n**STEP 1**:\nWe will start by identifying the type of the puzzle. The word “WRONG” suggests that this puzzle is an Anagram type puzzle. That means we need to shuffle the letters of the wordplay words to form the answer. The wordplay words to shuffle (the anagram fodder) can be word or phrase directly from the clue, or it could be indirect and cued by some words or phrase in the clue. \n**STEP 2**:\nWe will then find the definition. Since the definition is almost always either at the beginning or end of the clue sentence or phrase, we will assume “PRESIDENT” is the definition.\n**STEP 3**: \nWe will look at the word length of the answer. The enumeration suggests that the answer will be one word that is 10 letters long. \n**STEP 4**: \nWe will solve the puzzle by following the plan we made in STEP 1: since it’s an Anagram type puzzle, we will try to find the anagram fodder. We know that “PRESIDENT” is the definition and “WRONG” is the indicator, then we probably should find the anagram fodder in the rest of the sentence. The clue tells us “SAW NOTHING” *wrong*.\n1. We will see if there is a word or phrase in the clue, that is 10 letters long, so we can rearrange the letters and get the answer. “SAW NOTHING” happens to be 10 letters long. \n“SAW NOTHING” contains the letters “S A W N O T H I N G”. We know that the definition is “PRESIDENT”, so the first thing that comes to mind is presidents of the United states. Then if we look at the letters, we see that we can rearrange it to “WASHINGTON”.\n**STEP 5**:  \nWe will check if the answer we found is correct. FIRST, it fits the enumeration, because “WASHINGTON” is indeed one word with 10 letters.  SECOND, The word “WASHINGTON” is a meaningful word and fits the definition “PRESIDENT”. \nSo the answer is **WASHINGTON**"}
{"clue": "Mum, listen for a change (6)", "orientation": "across", "quick": true, "input": "**Clue**: Mum, listen for a change (6)\n**Orientation**: across", "explanation": "**Clue**: Mum, listen for a change (6)\n**STEP 1**:\nWe will start by identifying the type of the puzzle. The word “CHANGE” suggests that this puzzle is an Anagram type puzzle. That means we need to shuffle the letters of the wordplay words to form the answer. The wordplay words to shuffle (the anagram fodder) can be word or phrase directly from the clue, or it could be indirect and cued by some words or phrase in the clue. \n**STEP 2**:\nWe will then find the definition. Since the definition is almost always either at the beginning or end of the clue sentence or phrase, we will assume “MUM” is the definition.\n**STEP 3**: \nWe will look at the word length of the answer. The enumeration suggests that the answer will be one word that is 6 letters long. \n**STEP 4**: \nWe will solve the puzzle by following the plan we made in STEP 1: since it’s an Anagram type puzzle, we will try to find the anagram fodder. We know that “MUM” is the definition and “CHANGE” is the indicator, then we probably should find the anagram fodder in the rest of the sentence: “LISTEN FOR A”.\n1. We will see if there is a word or phrase in the clue, that is 6 letters long, so we can rearrange the letters and get the answer. “LISTEN” happens to be 6 letters long. \n“LISTEN” contains the letters “L I S T E N”. We know that the definition is “MUM”, since it’s a cryptic crossword puzzle, the first thing that comes to mind is the less used definition of “MUM”: not speaking; silent. Then if we look at the letters, we see that we can rearrange it to “SILENT”.\n**STEP 5**:  \nWe will check if the answer we found is correct. FIRST, it fits the enumeration, because “SILENT” is indeed one word with 6 letters.  SECOND, The word “SILENT” is a meaningful word and fits the definition “MUM”. \nSo the answer is **SILENT**"}
{"clue": "Fish and chips cooked with lard (9)", "orientation": "across", "quick": true, "input": "**Clue**: Fish and chips cooked with lard (9)\n**Orientation**: across", "explanation": "**Clue**: Fish and chips cooked with lard (9)\n**STEP 1**:\nWe will start by identifying the type of the puzzle. We can guess that the clue tells us “CHIPS” *(is) cooked with* “LARD”.\nThe word “COOKED” suggests that this puzzle is an Anagram type puzzle. That means we need to shuffle the letters of the wordplay words to form the answer. The wordplay words to shuffle (the anagram fodder) can be word or phrase directly from the clue, or it could be indirect and cued by some words or phrase in the clue. \n**STEP 2**:\nWe will then find the definition. Since the definition is almost always either at the beginning or end of the clue sentence or phrase, we will assume “FISH” is the definition.\nWe noticed that there is a commonly used linkword: “AND”. The linkword “AND” suggests that the answer, a synonym to the definition, can be formed from the rest of the clue. \n**STEP 3**: \nWe will look at the word length of the answer. The enumeration suggests that the answer will be one word that is 9 letters long. \n**STEP 4**: \nWe will solve the puzzle by following the plan we made in STEP 1: since it’s an Anagram type puzzle, we will try to find the anagram fodder. We know that “FISH” is the definition and “COOKED” is the indicator, then we probably should find the anagram fodder in the rest of the sentence. The clue tells us “CHIPS” *(is) cooked with* “LARD”.\n1. We will see if there is a word or phrase in the clue, that is 9 letters long, so we can rearrange the letters and get the answer. The combination of “CHIPS” and “LARD” happens to be 9 letters long. \n“CHIPS LARD” contains the letters “C H I P S L A R D”. We know that the definition is “FISH”, we are probably looking for a kind of fish. Also, since it’s a cryptic crossword puzzle, the answers are usually uncommon words. Then if we look at the letters, we see that we can rearrange it to “PILCHARDS”.\n**STEP 5**:  \nWe will check if the answer we found is correct. FIRST, it fits the enumeration, because “PILCHARDS” is indeed one word with 9 letters.  SECOND, The word “PILCHARDS” is a meaningful word and fits the definition “FISH”. \nSo the answer is **PILCHARDS**"}
{"clue": "In Poole he represented a port authority (9)", "orientation": "down", "quick": true, "input": "**Clue**: In Poole he represented a port authority (9)\n**Orientation**: down", "explanation": "**Clue**: In Poole he represented a port authority (9)\n**STEP 1**:\nWe will start by identifying the type of the puzzle. We can guess that the clue tells us to *re-present* “IN POOLE HE”. The word “REPRESENTED” suggests that this puzzle is an Anagram type puzzle. This is a tricky one, because we need to read it as “re-presented” to see that it is an indicator for anagram. That means we need to shuffle the letters of the wordplay words to form the answer. The wordplay words to shuffle (the anagram fodder) can be word or phrase directly from the clue, or it could be indirect and cued by some words or phrase in the clue. \n **STEP 2**:\nWe will then find the definition. Since the definition is almost always either at the beginning or end of the clue sentence or phrase, we will assume “A PORT AUTHORITY” is the definition. Because “IN POOL” is not likely to be a definition.\n**STEP 3**: \nWe will look at the word length of the answer. The enumeration suggests that the answer will be one word that is 9 letters long. \n**STEP 4**: \nWe will solve the puzzle by following the plan we made in STEP 1: since it’s an Anagram type puzzle, we will try to find the anagram fodder. We know that “A PORT AUTHORITY” is the definition and “REPRESENTED” is the indicator, then we probably should find the anagram fodder in the rest of the sentence. The clue tells us to *re-present* “IN POOLE HE”.\n1. We will see if there is a word or phrase in the clue, that is 9 letters long, so we can rearrange the letters and get the answer. The rest of the sentence, “IN POOLE HE” happens to be 9 letters long. \n“IN POOLE HE” contains the letters “I N P O O L E H E”. We know that the definition is “A PORT AUTHORITY”. Since it’s a cryptic crossword puzzle, the answers are usually uncommon words. Then if we look at the letters, we see that we can rearrange it to “OENOPHILE”.\n**STEP 5**:  \nWe will check if the answer we found is correct. FIRST, it fits the enumeration, because “OENOPHILE” is indeed one word with 9 letters.  SECOND, The word “OENOPHILE” is a meaningful word and fits the definition “A PORT AUTHORITY”. \nSo the answer is **OENOPHILE**"}
{"clue": "Fan smashing bottles left (9)", "orientation": "across", "quick": true, "input": "**Clue**: Fan smashing bottles left (9)\n**Orientation**: across", "explanation": "**Clue**: Fan smashing bottles left (9)\n**STEP 1**:\nWe will start by identifying the type of the puzzle. We can guess that the clue tells us that “SMASHING” *bottles(contains)* “LEFT”. The word “BOTTLES” suggests that this puzzle is a Sandwich type puzzle. That means we need to find two sets of wordplay words, and we will split one wordplay word and stuff the other wordplay word inside of it to form the answer. \n**STEP 2**:\nWe will then find the definition. Since the definition is almost always either at the beginning or end of the clue sentence or phrase, we will assume “FAN” is the definition.\n**STEP 3**: \nWe will look at the word length of the answer. The enumeration suggests that the answer will be one word that is 9 letters long. \n**STEP 4**: \nWe will solve the puzzle by following the plan we made in STEP 1: since it’s a Sandwich type puzzle, we will first find the two sets of wordplay words. We know that “FAN” is the definition and “BOTTLES” is the indicator. The clue tells us that “SMASHING” *bottles(contains)* “LEFT”.\nIt's still not quite clear what the answer can be. Let’s think from another direction: If we think about it:\n1. The answer is synonym of  “FAN” \n2. The answer is one word with 9 letters\nwe would think about the word “SUPPORTER”.\nNow we will see if we can form this answer from the wordplay words. What’s left in the clue are “SMASHING” and “LEFT”. Since it’s a cryptic crossword puzzle, the cueing words are usually taking the uncommon meanings, so we have to be creative. “SMASHING” could cue the word “SUPER” (in British slang)  and “LEFT” could cue the word “PORT” (in nautical terms).\n The indicator “BOTTLES” suggests that the first wordplay word “encloses” the second. So we probably should split “SUPER” and stuff “PORT” in between, and we will get “SUPPORTER”. \n**STEP 5**:  \nWe will check if the answer we found is correct. FIRST, it fits the enumeration, because “SUPPORTER” is indeed one word with 9 letters.  SECOND, The word “SUPPORTER” is a meaningful word and fits the definition “FAN”. \nSo the answer is **SUPPORTER**"}
{"clue": "Family member put us in the money (6)", "orientation": "across", "quick": true, "input": "**Clue**: Family member put us in the money (6)\n**Orientation**: across", "explanation": "**Clue**: Family member put us in the money (6)\n**STEP 1**:\nWe will start by identifying the type of the puzzle. We can guess that the clue tells us to *put* “US” *in the* ”MONEY”. The phrase “PUT … IN THE” suggests that this puzzle is a Sandwich type puzzle. That means we need to find two sets of wordplay words, and we will split one wordplay word and stuff the other wordplay word inside to form the answer.\n**STEP 2**:\nWe will then find the definition. Since the definition is almost always either at the beginning or end of the clue sentence or phrase, we will assume “FAMILY MEMBER” is the definition.\n**STEP 3**: \nWe will look at the word length of the answer. The enumeration suggests that the answer will be one word that is 6 letters long. \n**STEP 4**: \nWe will solve the puzzle by following the plan we made in STEP 1: since it’s a Sandwich type puzzle, we will first find the two sets of wordplay words. Since the clue tells us to *put* “US” *in the* ”MONEY”, maybe the first wordplay word is “US” itself. And we just need to find the second wordplay word from “MONEY”.\nIt's still not quite clear what the answer can be. Let’s think from another direction: If we think about it:\n1. The answer is synonym of  “FAMILY MEMBER” \n2. The answer is one word with 6 letters\n3. There are letter “US” in the middle of the answer\nwe would think about the word “COUSIN”. And indeed, “COUSIN” is stuffing “US” inside “CO-IN”. And indeed, “COIN” can be cued by “MONEY”. \n**STEP 5**:  \nWe will check if the answer we found is correct. FIRST, it fits the enumeration, because “COUSIN” is indeed one word with 6 letters.  SECOND, The word “COUSIN” is a meaningful word and fits the definition “FAMILY MEMBER”. \nSo the answer is **COUSIN**"}
{"clue": "Reportedly makes pots (4)", "orientation": "across", "quick": true, "input": "**Clue**: Reportedly makes pots (4)\n**Orientation**: across", "explanation": "**Clue**: Reportedly makes pots (4)\n**STEP 1**:\nWe will start by identifying the type of the puzzle. The word “REPORTEDLY” suggests that this puzzle is a Homophone type puzzle. That means we need to find a wordplay word, so that the answer fits the enumeration, sounds like the wordplay words, and fits the definition.\n**STEP 2**:\nWe will then find the definition. Since the definition is almost always either at the beginning or end of the clue sentence or phrase, we will assume “POTS” is the definition. Because “REPORTEDLY” is not likely the definition. \n**STEP 3**: \nWe will look at the word length of the answer. The enumeration suggests that the answer will be one word that is 4 letters long. \n**STEP 4**: \nWe will solve the puzzle by following the plan we made in STEP 1: since it’s a Homophone type puzzle, we need to find the wordplay word that the answer will sound like. Since “POTS” is the definition, and “REPORTEDLY” is the indicator, what’s left in the clue is “MAKES”. \nFrom one direction, we will try to see what can we get from the clue “MAKE”\n1. First we see if there are any words that sound like “MAKES” and mean “POTS”. We can’t think of any. \n2. Then we see if we can find the wordplay word from “MAKES”. \nA synonym for “MAKES” is “EARNS”. \nIt's still not quite clear what the answer can be. Let’s think from another direction: If we think about it:\n1. The answer is synonym of  “POTS” \n2. The answer is one word with 4 letters\n3. The answer sounds like “EARNS”\nWe may think of the word “URNS”. \nAnd indeed,“EARNS”, the synonym of “MAKES”, sounds like “URNS”, the synonym of “POTS”. \n**STEP 5**:  \nWe will check if the answer we found is correct. FIRST, it fits the enumeration, because “URNS” is indeed one word with 4 letters.  SECOND, The word “URNS” is a meaningful word and fits the definition “POTS”. \nSo the answer is **URNS**"}
{"clue": "Parched in the Kalahari desert (4)", "orientation": "down", "quick": true, "input": "**Clue**: Parched in the Kalahari desert (4)\n**Orientation**: down", "explanation": "**Clue**: Parched in the Kalahari desert (4)\n**STEP 1**:\nWe will start by identifying the type of the puzzle. We can guess that the clue tells us the answer is *in the* “KALAHARI DESERT”. The word “IN” doesn’t seem like a linkword, so it suggests that this puzzle is a Hidden Word type puzzle. That means the answer we need to find hides inside the concatenation of the words. We just need to concatenate words in the clue, and find the answer that hides inside of them.\n**STEP 2**:\nWe will then find the definition. Since the definition is almost always either at the beginning or end of the clue sentence or phrase, we will assume “PARCHED” is the definition. \n**STEP 3**: \nWe will look at the word length of the answer. The enumeration suggests that the answer will be one word that is 4 letters long. \n**STEP 4**: \nWe will solve the puzzle by following the plan we made in STEP 1: since “PARCHED” is the definition, and “IN” is the indicator, then we probably should look at the rest of the sentence. Usually the hidden word answer hides at the connection of two consecutive words —- it’s made from the end part of a word and the beginning part of the next word. So we will pay more attention to that. \nFirst we will concatenate the rest of the sentence: the clue tells us the answer is *in the* “KALAHARIDESERT”. And we are looking for the word that is:\n1. The synonym of “PARCHED”\n2. One word with 4 letters long: So we will just scan the concatenate string with a ‘sliding window’ of 4 letters. (“KALA”, “ALAH”, LAHA”, ……)\n3. Likely to hide at the connection place of two words.\nWe see that “ARID” in “KALAH*ARID*ESERT” stands out. And indeed, “ARID” is a synonym of “PARCHED”\n**STEP 5**:  \nWe will check if the answer we found is correct. FIRST, it fits the enumeration, because “ARID” is indeed one word with 4 letters.  SECOND, The word “ARID” is a meaningful word and fits the definition “PARCHED”. \nSo the answer is **ARID**"}
{"clue": "Odd bits of culture such as this (4)", "orientation": "across", "quick": true, "input": "**Clue**: Odd bits of culture such as this (4)\n**Orientation**: across", "explanation": "**Clue**: Odd bits of culture such as this (4)\n**STEP 1**:\nWe will start by identifying the type of the puzzle. The word “ODD” suggests that this puzzle is a Letter Manipulation - Concatenation type puzzle. That means the answer we need to find hides inside the concatenation of some letters. Since the indicator here is “ODD”, we will take all the odd letters to concatenate, and then look if there are words hiding inside the concatenated string.\n**STEP 2**:\nWe will then find the definition. Since the definition is almost always either at the beginning or end of the clue sentence or phrase, we will assume “SUCH AS THIS” is the definition. Because “ODD BITS” is not likely to be a definition. \n**STEP 3**: \nWe will look at the word length of the answer. The enumeration suggests that the answer will be one word that is 4 letters long. \n**STEP 4**: \nWe will solve the puzzle by following the plan we made in STEP 1: since “SUCH AS THIS” is the definition, and “ODD\" is the indicator, then we probably should look at the rest of the sentence. The clues says, we should take the “ODD BITS OF *CULTURE*”, so we will try to take the odd letters of culture, “C L U E”, and concatenate it —- “CLUE”. \nIt is already a word of 4 letters. \nAnd indeed, “CLUE” fits the definition “SUCH AS THIS”, because “THIS” in “SUCH AS THIS” is referring to the clue itself, this is a clue. It is a bit tricky, but it makes perfect sense. \n**STEP 5**:  \nWe will check if the answer we found is correct. FIRST, it fits the enumeration, because “CLUE” is indeed one word with 4 letters.  SECOND, The word “CLUE” is a meaningful word and fits the definition “SUCH AS THIS”. \nSo the answer is **CLUE**"}
{"clue": "Get employed right away in Surrey town (6) ", "orientation": "down", "quick": true, "input": "**Clue**: Get employed right away in Surrey town (6) \n**Orientation**: down", "explanation": "**Clue**: Get employed right away in Surrey town (6) \n**STEP 1**:\nWe will start by identifying the type of the puzzle. We can guess that the clue tells us to *get* “EMPLOYED” “RIGHT” *away*. The word “GET … AWAY” suggests that this puzzle is a Letter Manipulation - Deletion type puzzle. That means we are deleting something from the wordplay word. So we need to find the wordplay word, and find what should be deleted from the wordplay word. \n**STEP 2**:\nWe will then find the definition. Since the definition is almost always either at the beginning or end of the clue sentence or phrase, we will assume “SURREY TOWN” is the definition. \n**STEP 3**: \nWe will look at the word length of the answer. The enumeration suggests that the answer will be one word that is 6 letters long. \n**STEP 4**: \nWe will solve the puzzle by following the plan we made in STEP 1: since “SURREY TOWN” is the definition, and “GET … AWAY\" is the indicator, then we probably should look at the rest of the sentence. The clue tells us to *get* “EMPLOYED” “RIGHT” *away*.\nIt's still not quite clear what the answer can be. Let’s think from another direction: If we think about it:\n1. The answer is a  “SURREY TOWN” \n2. The answer is one word with 6 letters\nThen we can think of the town “WOKING”. Now we look back, indeed, “EMPLOYED” can cue “WORKING” and if we take the “R” away from “WORKING”, we get “WOKING”. And then, indeed, “RIGHT” in the clue can cue the letter “R” (abbreviation). \nSo we get “WORKING” from “EMPLOYED”, “R” from “RIGHT”, the indicator “GET … AWAY” suggests that we will take the “R” away from “WORKING” to form “WOKING”. \n**STEP 5**:  \nWe will check if the answer we found is correct. FIRST, it fits the enumeration, because “WOKING” is indeed one word with 6 letters.  SECOND, The word “WOKING” is a meaningful word and fits the definition “SURREY TOWN”. \nSo the answer is **WOKING**"}
{"clue": "Possess a topless dress (3)", "orientation": "across", "quick": true, "input": "**Clue**: Possess a topless dress (3)\n**Orientation**: across", "explanation": "**Clue**: Possess a topless dress (3)\n**STEP 1**:\nWe will start by identifying the type of the puzzle. We can guess that the clue tells us to *topless* “DRESS”. The word “TOPLESS” suggests that this puzzle is a Letter Manipulation - Deletion type puzzle. That means we are deleting something from the wordplay word. Here topless is likely to suggest that we are taking the initial letters away from some word. So we need to find the wordplay word, and take the initial letters away from it to form the answer. \n**STEP 2**:\nWe will then find the definition. Since the definition is almost always either at the beginning or end of the clue sentence or phrase, we will assume “POSSESS” is the definition. \n**STEP 3**: \nWe will look at the word length of the answer. The enumeration suggests that the answer will be one word that is 3 letters long. \n**STEP 4**: \nWe will solve the puzzle by following the plan we made in STEP 1: since “POSSESS” is the definition, and “TOPLESS\" is the indicator, then we probably should look at the rest of the sentence. The clue tells us to *topless* “DRESS”. \nFrom one direction, the word “DRESS” can cue “GOWN”, and if we take the initial letter “G” away, we get the word “OWN”. \nIt's still not quite clear what the answer can be. Let’s think from another direction: if we think about it: \n1. The answer is synonym of  “POSSESS” \n2. The answer is one word with 3 letters\nWe can think of the word “OWN”. And indeed, the word “OWN” can be formed from “GOWN”, and “GOWN” is a type of dress."}
{"clue": "Knocked back beer like a king (5)", "orientation": "down", "quick": true, "input": "**Clue**: Knocked back beer like a king (5)\n**Orientation**: down", "explanation": "**Clue**: Knocked back beer like a king (5)\n**STEP 1**:\nWe will start by identifying the type of the puzzle. We can guess that the clue tells us to *knock back* “BEER”. The word “KNOCK BACK” suggests that this puzzle is a Reversal type puzzle. That means we will first find the wordplay word to reverse, and then we will reverse the letter of it to get the answer. \n**STEP 2**:\nWe will then find the definition. Since the definition is almost always either at the beginning or end of the clue sentence or phrase, we will assume “LIKE A KING” is the definition. Since “KNOCK BACK” doesn’t seem like a definition. \n**STEP 3**: \nWe will look at the word length of the answer. The enumeration suggests that the answer will be one word that is 5 letters long. \n**STEP 4**: \nWe will solve the puzzle by following the plan we made in STEP 1: since “LIKE A KING” is the definition, and “KNOCK BACK\" is the indicator, then we probably should look at the rest of the sentence. \nFrom one direction, we see that the clue tells us to *knock back* “BEER”:\n1. Since “BEER” has only 4 letters, and the answer is 5 letters long, we cannot get the answer by reversing the letters of “BEER”.\n2. So we will try to find a wordplay word from “BEER” that is 5 letters long \nIt's still not quite clear what the answer can be. Let’s think from another direction: If we think about it:\n1. The answer is  “LIKE A KING” \n2. The answer is one word with 5 letters\nThen we can think of the town “REGAL”. And indeed, if we reverse “REGAL”, we get “LAGER”, which is a kind of “BEER”.\nSo we can conclude that, the word “BEER” cue “LAGER”, and if we reverse “LAGER” we get “REGAL”. \n**STEP 5**:  \nWe will check if the answer we found is correct. FIRST, it fits the enumeration, because “REGAL” is indeed one word with 5 letters.  SECOND, The word “REGAL” is a meaningful word and fits the definition “LIKE A KING”. \nSo the answer is **REGAL**"}
{"clue": "Put out by mounting objections (4)", "orientation": "down", "quick": true, "input": "**Clue**: Put out by mounting objections (4)\n**Orientation**: down", "explanation": "**Clue**: Put out by mounting objections (4)\n**STEP 1**:\nWe will start by identifying the type of the puzzle. We can guess that the clue tells us to “mount” “OBJECTIONS”. Since this is a down clue, the word “MOUNTING” suggests that this puzzle is a Reversal type puzzle. That means we will first find the wordplay word to reverse, and then we will reverse the letter of it to get the answer.\n**STEP 2**:\nWe will then find the definition. Since the definition is almost always either at the beginning or end of the clue sentence or phrase, we will assume “PUT OUT” is the definition. \nWe noticed that there is a commonly used linkword: “BY”. The linkword “BY” suggests that the answer, a synonym to the definition, can be formed from the rest of the clue. \n**STEP 3**: \nWe will look at the word length of the answer. The enumeration suggests that the answer will be one word that is 4 letters long. \n**STEP 4**: \nWe will solve the puzzle by following the plan we made in STEP 1: since “PUT OUT”” is the definition, “BY” is the link word, and “MOUNTING\" is the indicator, then we probably should look at the rest of the sentence. The clue tells us to “mount” “OBJECTIONS”. \nFrom one direction, we will try to get the wordplay word to reverse, given that “OBJECTIONS” is what’s left in the sentence:\n1. Since “OBJECTIONS” has only 10  letters, and the answer is 4 letters long, we cannot get the answer by reversing the letters of “OBJECTIONS”.\n3. So we will try to find a wordplay word from “OBJECTIONS” that is 4 letters long \nIt's still not quite clear what the answer can be. Let’s think from another direction: If we think about it:\n1. The answer is  synonym of “PUT OUT” \n2. The answer is one word with 4 letters\nCombining the two directions, we can think of the word “STUB”. And indeed, if we reverse “STUB”, we get “BUTS”, which fits the definition “OBJECTIONS”.\nSo we can conclude that, the word “OBJECTIONS” cue “BUTS”, and if we reverse “BUTS” we get “STUB”. \n**STEP 5**:  \nWe will check if the answer we found is correct. FIRST, it fits the enumeration, because “STUB” is indeed one word with 4 letters.  SECOND, The word “STUB” is a meaningful word and fits the definition “PUT OUT”. \nSo the answer is **STUB**"}
{"clue": "Axed when West’s moved (4)", "orientation": "down", "quick": true, "input": "**Clue**: Axed when West’s moved (4)\n**Orientation**: down", "explanation": "**Clue**: Axed when West’s moved (4)\n**STEP 1**:\nWe will start by identifying the type of the puzzle. We can guess that the clue tells us “WHEN WEST’S” *moved*. The word “MOVED” suggests that this puzzle is a Letter Manipulation - Moving type puzzle. That means we will first find the wordplay word, and the letter to switch, then we will switch the letter in the wordplay word to get the answer. In particular, the word “MOVED” suggests that after we found the wordplay word, and the letter to switch, we are moving the letter to switch in the wordplay word. \n**STEP 2**:\nWe will then find the definition. Since the definition is almost always either at the beginning or end of the clue sentence or phrase, we will assume “AXED” is the definition. \n**STEP 3**: \nWe will look at the word length of the answer. The enumeration suggests that the answer will be one word that is 4 letters long. \n**STEP 4**: \nWe will solve the puzzle by following the plan we made in STEP 1: since “AXED”” is the definition, and “MOVED\" is the indicator, then we probably should look at the rest of the sentence. The clue tells us “WHEN WEST’S” *moved*, so we can see that \n1. “WHEN” is the wordplay word we want to switch the letters of. \n2. “WEST’S MOVED” suggests that we are moving the letter “W”, since “WEST” cues “W” (abbreviation). \nFrom another direction: if we think about it:\n1. The answer is something related to “AXED” \n2. The answer is one word with 4 letters\n3. We are moving the “W” in “When”.\nThen we can think of the word “HEWN”. Which fits the definition of “AXED”. \n**STEP 5**:  \nWe will check if the answer we found is correct. FIRST, it fits the enumeration, because “HEWN” is indeed one word with 4 letters.  SECOND, The word “HEWN” is a meaningful word and fits the definition “AXED”. \nSo the answer is **HEWN**"}
{"clue": "Heads of the several amalgamated Russian states (5)", "orientation": "down", "quick": true, "input": "**Clue**: Heads of the several amalgamated Russian states (5)\n**Orientation**: down", "explanation": "**Clue**: Heads of the several amalgamated Russian states (5)\n**STEP 1**:\nWe will start by identifying the type of the puzzle. We can guess that the clue tells us to look at the *head of* “THE SEVERAL AMALGAMATED RUSSIAN STATES”. The word “HEADS” suggests that this puzzle is a Letter Manipulation - Concatenation type puzzle. That means we will concatenate the initials of the wordplay words, and find our answers inside of it. \n**STEP 2**:\nWe will then find the definition. Although the definition is almost always either at the beginning or end of the clue sentence or phrase, we see that the clue is a short sentence that is a clear description of something. So this may be a “&lit” typed puzzle, and the definition will overlap with the wordplay, in this case the definition can be the entire sentence: “HEADS OF THE SEVERAL AMALGAMATED RUSSIAN STATES”. \n**STEP 3**: \nWe will look at the word length of the answer. The enumeration suggests that the answer will be one word that is 5 letters long. \n**STEP 4**: \nWe will solve the puzzle by following the plan we made in STEP 1: We know “HEADS OF THE SEVERAL AMALGAMATED RUSSIAN STATES”” is the definition, and “HEADS\" is the indicator. But since it's a “&lit” type of problem, the definition will overlap with the wordplay. \nSince the clue tells us to look at the *head of* “THE SEVERAL AMALGAMATED RUSSIAN STATES”, we will take the initials of it, and we get “TSARS”\nAnd indeed, “TSARS” fits the definition “HEADS OF THE SEVERAL AMALGAMATED RUSSIAN STATES”\n**STEP 5**:  \nWe will check if the answer we found is correct. FIRST, it fits the enumeration, because “TSARS” is indeed one word with 5 letters.  SECOND, The word “TSARS” is a meaningful word and fits the definition “HEADS OF THE SEVERAL AMALGAMATED RUSSIAN STATES”. \nSo the answer is **TSARS**"}
{"clue": "Sort of roll, A-E etc? (9)", "orientation": "across", "quick": true, "input": "**Clue**: Sort of roll, A-E etc? (9)\n**Orientation**: across", "explanation": "**Clue**: Sort of roll, A-E etc? (9)\n**STEP 1**:\nWe will start by identifying the type of the puzzle. We can guess that the clue tells us it is the *sort of* “ROLL A E ETC”. The word “SORT” suggests that this puzzle is an Anagram type puzzle. That means we need to shuffle the letters of the wordplay words to form the answer. The wordplay words to shuffle (the anagram fodder) can be word or phrase directly from the clue, or it could be indirect and cued by some words or phrase in the clue. \n**STEP 2**:\nWe will then find the definition. Although the definition is almost always either at the beginning or end of the clue sentence or phrase, we see that the clue is a short sentence that is a clear description of something. So this may be a “&lit” typed puzzle, and the definition will overlap with the wordplay, in this case, the definition is the entire sentence: “SORT OF ROLL, A-E ETC?”.\n**STEP 3**: \nWe will look at the word length of the answer. The enumeration suggests that the answer will be one word that is 9 letters long. \n**STEP 4**: \nWe will solve the puzzle by following the plan we made in STEP 1: We know “SORT OF ROLL, A-E ETC?”” is the definition, and “SORT\" is the indicator. But since it's a “&lit” type of problem, the definition will overlap with the wordplay. The clue tells us it is the *sort of* “ROLL A E ETC”. \n1. We will see if there is a word or phrase in the clue, that is 9 letters long, so we can rearrange the letters and get the answer. “ROLL A E ETC” happens to be 9 letters long.\n“ROLL A E ETC” contains the letters “R O L L A E E T C”. We know that the definition is “SORT OF ROLL, A-E ETC?”. If we look at the letters, we see that we can rearrange it to “ELECTORAL”.\n**STEP 5**:  \nWe will check if the answer we found is correct. FIRST, it fits the enumeration, because “ELECTORAL” is indeed one word with 9 letters.  SECOND, The word “ELECTORAL” is a meaningful word and fits the definition “SORT OF ROLL, A-E ETC?”. \nSo the answer is **ELECTORAL**"}
{"clue": "Shoots game (5)", "orientation": "across", "quick": true, "input": "**Clue**: Shoots game (5)\n**Orientation**: across", "explanation": "**Clue**: Shoots game (5)\n**STEP 1**:\nWe will start by identifying the type of the puzzle. We see that the clue can be separated into two reasonable descriptions of something, especially here there are only two words in the clue, which is a strong indicator that this is a Double Definition type. So I assume that this is a Double Definition type puzzle. That means we need to find the answer that simultaneously satisfies both definition, and the enumeration field. \n**STEP 2**:\nWe will then find the definition. Although the definition is almost always either at the beginning or end of the clue sentence or phrase, we see that the clue can be separated into two reasonable descriptions of something. And also consider that this puzzle only has two words, so this may be a Double definition typed puzzle, and the two definitions are: Definition 1 is “SHOOTS”, definition 2 is “GAME”. \n**STEP 3**: \nWe will look at the word length of the answer. The enumeration suggests that the answer will be one word that is 5 letters long. \n**STEP 4**: \nWe will solve the puzzle by following the plan we made in STEP 1: We know that the answer need to satisfy three constraints:\n1. It must fit definition 1: “SHOOTS”\n2. It must fit definition 2: “GAME”. \n3. It must be one word that is 5 letters long. \nSo we can think of the word “DARTS”. Because “SHOOTS” can cue the word “DARTS” and “GAME” can also cue the word “DARTS”. \n**STEP 5**:  \nWe will check if the answer we found is correct. FIRST, it fits the enumeration, because “DARTS” is indeed one word with 5 letters.  SECOND, The word “DARTS” is a meaningful word and fits the definition “SHOOTS” and “GAME”. \nSo the answer is **DARTS**"}
{"clue": "Pools entries making one a rich man (5)", "orientation": "down", "quick": true, "input": "**Clue**: Pools entries making one a rich man (5)\n**Orientation**: down", "explanation": "**Clue**: Pools entries making one a rich man (5)\n**STEP 1**:\nWe will start by identifying the type of the puzzle. We see that the clue can be separated into two reasonable descriptions of something, so I assume that this is a Double Definition type puzzle. That means we need to find the answer that simultaneously satisfies both definition, and the enumeration field. \n**STEP 2**:\nWe will then find the definition. Although the definition is almost always either at the beginning or end of the clue sentence or phrase, we see that the clue can be separated into two reasonable descriptions of something. So this may be a Double definition typed puzzle, and the two definitions are: Definition 1 is “POOLS ENTRIES ”, definition 2 is “A RICH MAN”. We can see that here “MAKING ONE” is a link word that separates this sentence into two parts. \n**STEP 3**: \nWe will look at the word length of the answer. The enumeration suggests that the answer will be one word that is 5 letters long. \n**STEP 4**: \nWe will solve the puzzle by following the plan we made in STEP 1: We know that the answer need to satisfy three constraints:\n4. It must fit definition 1: “POOLS ENTRIES”\n5. It must fit definition 2: “A RICH MAN”. \n6. It must be one word that is 5 letters long. \nSo we can think of the word “DIVES”. Because “POOLS ENTRIES” can cue the word “DIVES” and “A RICH MAN” can also cue the word “DIVES”. \n**STEP 5**:  \nWe will check if the answer we found is correct. FIRST, it fits the enumeration, because “DIVES” is indeed one word with 5 letters.  SECOND, The word “DIVES” is a meaningful word and fits the definition “POOLS ENTRIES” and “A RICH MAN”. \nSo the answer is **DIVES**"}
{"clue": "Glance at the fixtures - nothing much on (8)", "orientation": "down", "quick": true, "input": "**Clue**: Glance at the fixtures - nothing much on (8)\n**Orientation**: down", "explanation": "**Clue**: Glance at the fixtures - nothing much on (8)\n**STEP 1**: \nWe will start by identifying the type of the puzzle. We can guess that clue tells us “GLANCE” *at the* “FIXTURES”. We cannot find any indicators for this clue, we assume that it is a Charade (additive) type of puzzle. That means we need to find wordplay words from words or phrases in the clue, and concatenate the wordplay words together. \n**STEP 2**: \nWe will then find the definition. Since the definition is almost always either at the beginning or end of the clue sentence or phrase, we would assume that “NOTHING MUCH ON” is the definition, since “GLANCE AT THE FIXTURES” doesn’t look like a definition. \n**STEP 3**: \nWe will look at the word length of the answer. The enumeration suggests that the answer will be one word that is 8 letters long. \n**STEP 4**: \nWe will solve the puzzle by following the plan we made in STEP 1: since it’s a Charade type puzzle, we will try to find the wordplay words that each phrase in the puzzle cues. The clue tells us “GLANCE” *at the* “FIXTURES”. Maybe the wordplay words are “GLANCE” and “FIXTURES”. \n“GLANCE” can cue “SCAN”. \nIt's still not quite clear what the answer can be. Let’s think from another direction: If we think about it:\n1. The answer is synonym of  “NOTHING MUCH ON” \n2. The answer is one word with 8 letters\n3. The word starts with “SCAN”\nwe would think about the word “SCANTIES”. And indeed, “FIXTURES” can reasonably cue “TIES”. If we put the wordplay words “SCAN” and “TIES” together, we will get the word “SCANTIES”.\n**STEP 5**:  \nWe will check if the answer we found is correct. FIRST, it fits the enumeration, because “SCANTIES” is indeed one word with 8 letters. SECOND, the word “SCANTIES” is a meaningful word and fits the definition “NOTHING MUCH ON”. \nSo the answer is **SCANTIES**"}
{"clue": "Plain nan as starter in separate quarters (6, 4)", "orientation": "down", "quick": true, "input": "**Clue**: Plain nan as starter in separate quarters (6, 4)\n**Orientation**: down", "explanation": "**Clue**: Plain nan as starter in separate quarters (6, 4)\n**STEP 1**: \nWe will start by identifying the type of the puzzle. We can guess that the clue tells us “PLAIN NAN” *as starter*. We cannot find any indicators for this clue, we assume that it is a Charade (additive) type of puzzle. That means we need to find wordplay words from words or phrases in the clue, and concatenate the wordplay words together. \n**STEP 2**: \nWe will then find the definition. Since the definition is almost always either at the beginning or end of the clue sentence or phrase, we would assume that “SEPARATE QUARTERS” is the definition, since “PLAIN NAN” doesn’t look like a definition. \nWe noticed that there is a commonly used linkword: “IN”.\n**STEP 3**: \nWe will look at the word length of the answer. The enumeration suggests that the answer will be two words, 6 and 4 letters long each, in total of 10 letters. \n**STEP 4**: \nWe will solve the puzzle by following the plan we made in STEP 1: since it’s a Charade type puzzle, we will try to find the wordplay words that each phrase in the puzzle cues. The clue tells us “PLAIN NAN” *as starter*. So maybe “PLAIN” and “NAN” are the two wordplay words. \nAlso, we see that the clue tells us “NAN” *as starter*, maybe it indicates that the word “NAN” cues should be placed in the first place. \nWe know that the first word is 6 letters long. “NAN” can cue “GRANNY”, which is also 6 letters long. We know that the second word is 4 letters long, “PLAIN” can cue “FLAT”, which is also 4 letters long. \nIt's still not quite clear what the answer can be. Let’s think from another direction: If we think about it:\n1. The answer is synonym of  “SEPARATE QUARTERS” \n2. The answer is two words, 6 and 4 letters long each\n3. The word starts with “GRANNY”\nwe would think about the word “GRANNY FLAT”. If we put the wordplay words “GRANNY” and “FLAT” together, we will get the word “GRANNY FLAT”.\n**STEP 5**:  \nWe will check if the answer we found is correct. FIRST, it fits the enumeration, because “GRANNY FLAT” is indeed two words, 6 and 4 letters long each. SECOND, the word “GRANNY FLAT” is a meaningful word and fits the definition “SEPARATE QUARTERS”. \nSo the answer is **GRANNY FLAT**"}
{"clue": "Part of Madeira one might sail through (5, 2, 4)", "orientation": "across", "quick": true, "input": "**Clue**: Part of Madeira one might sail through (5, 2, 4)\n**Orientation**: across", "explanation": "**Clue**: Part of Madeira one might sail through (5, 2, 4)\n**STEP 1**: \nWe will start by identifying the type of the puzzle. We cannot find any indicators for this clue, we assume that it is a Cryptic Definition type of puzzle. We will plan what to do: we need to find two ideas given in the clue, and find words that connect the two ideas found in the clue. \n**STEP 2**: \nWe will then find the definition. Since the definition is almost always either at the beginning or end of the clue sentence or phrase, we would assume that “ONE MIGHT SAIL THROUGH” is the definition.\n**STEP 3**: \nWe will look at the word length of the answer. The enumeration suggests that the answer will be three words, 5, 2 and 4 letters long each, in total of 11 letters.\n**STEP 4**: \nWe will solve the puzzle by following the plan we made in STEP 1:\n1. “PART OF MADEIRA” could mean something that’s related to Madeira. \n2. “ONE MIGHT SAIL THROUGH” means something that’s easy. \nThen we will find words that can relate these two ideas together. If we think about something that’s related to Madeira, we could think about “Madeira cake”. If we think about cake and something that’s easy, and that is three words long, we would think about the phrase “PIECE OF CAKE”. \n**STEP 5**:  \nWe will check if the answer we found is correct. FIRST, it fits the enumeration, because “PIECE OF CAKE” is indeed three words, 5, 2 and 4 letters long each. SECOND, the word “PIECE OF CAKE” is a meaningful word and fits the definition “ONE MIGHT SAIL THROUGH”. \nSo the answer is **PIECE OF CAKE**"}
{"clue": "Roman marbles lost (3, 6, 6)", "orientation": "down", "quick": true, "input": "**Clue**: Roman marbles lost (3, 6, 6)\n**Orientation**: down", "explanation": "**Clue**: Roman marbles lost (3, 6, 6)\n**STEP 1**: \nWe will start by identifying the type of the puzzle. We cannot find any indicators for this clue, we assume that it is a Cryptic Definition type of puzzle. That means we need to find two ideas given in the clue, and find words that connect the two ideas found in the clue. \n**STEP 2**: \nWe will then find the definition. Since the definition is almost always either at the beginning or end of the clue sentence or phrase, we would assume that “MARBLES LOST” is the definition.\n**STEP 3**: \nWe will look at the word length of the answer. The enumeration suggests that the answer will be three words, 3, 6 and 6 letters long each, in total of 15 letters.\n**STEP 4**: \nWe will solve the puzzle by following the plan we made in STEP 1:\n1. “ROMAN” could mean something that’s related to Rome. \n2. “MARBLES LOST” means something that’s out of sound mind. \nThen we will find words that can relate these two ideas together. If we think about something that’s related to Rome, we could think about their language Latin. If we think about Latin and something that’s out of sound mind, and that the answer is 3 words long, we would think about the phrase “NON COMPOS MENTIS”. \n**STEP 5**:  \nWe will check if the answer we found is correct. FIRST, it fits the enumeration, because “NON COMPOS MENTIS” is indeed three words, 3, 6 and 6 letters long each. SECOND, the word “NON COMPOS MENTIS” is a meaningful word and fits the definition “MARBLES LOST”. \nSo the answer is **NON COMPOS MENTIS**"}
{"clue": "Lettuce constituent of salad, primarily (3)", "orientation": "across", "quick": true, "input": "**Clue**: Lettuce constituent of salad, primarily (3)\n**Orientation**: across", "explanation": "**Clue**: Lettuce constituent of salad, primarily (3)\n**STEP 1**:\nWe will start by identifying the type of the puzzle. We can guess that the clue tells us “CONSTITUENT OF SALAD”, *primarily*. The word “PRIMARILY” suggests that this puzzle is a Letter Manipulation - Concatenation type puzzle. That means we will concatenate the initials of the wordplay words, and find our answers inside of it. \n**STEP 2**:\nWe will then find the definition. Since the definition is almost always either at the beginning or end of the clue sentence or phrase, we will assume “LETTUCE” is the definition.\n**STEP 3**: \nWe will look at the word length of the answer. The enumeration suggests that the answer will be one word that is 3 letters long. \n**STEP 4**: \nWe will solve the puzzle by following the plan we made in STEP 1: We know “LETTUCE” is the definition, and “PRIMARILY\" is the indicator, then we probably should look at the rest of the sentence. Consider the answer is 3 letters long, and the clue tells us “CONSTITUENT OF SALAD”, *primarily*, we will take the initials of it, and we get “COS”\nAnd indeed, “COS” fits the definition “LETTUCE”, it is a lettuce salad ingredient.\n**STEP 5**:  \nWe will check if the answer we found is correct. FIRST, it fits the enumeration, because “COS” is indeed one word with 3 letters.  SECOND, The word “COS” is a meaningful word and fits the definition “LETTUCE”. \nSo the answer is **COS**"}
{"clue": "Endless industrial action in a Scandinavian port (4)", "orientation": "across", "quick": true, "input": "**Clue**: Endless industrial action in a Scandinavian port (4)\n**Orientation**: across", "explanation": "**Clue**: Endless industrial action in a Scandinavian port (4)\n**STEP 1**:\nWe will start by identifying the type of the puzzle. We can guess that the clue tells us it’s *endless* “INDUSTRIAL ACTION”. The word “ENDLESS” suggests that this puzzle is a Letter Manipulation - Deletion type puzzle. That means we need to figure out what to do. “ENDLESS” could mean that we need to remove the first and last letter of the wordplay word in order to form the answer. Since the first and last letter are the *ends* of the wordplay word. **STEP 2**:\nWe will then find the definition. Since the definition is almost always either at the beginning or end of the clue sentence or phrase, we will assume “A SCANDINAVIAN PORT” is the definition.\n**STEP 3**: \nWe will look at the word length of the answer. The enumeration suggests that the answer will be one word that is 4 letters long. \n**STEP 4**: \nWe will solve the puzzle by following the plan we made in STEP 1:\nFirst, we need to find the wordplay word. Consider “A SCANDINAVIAN PORT” is the definition and “ENDLESS” is the indicator. “IN” is probably a linkword. Then we probably should look at the rest of the sentence. The clue tells us it’s *endless* “INDUSTRIAL ACTION”. \nIf we take the first and last letter from “INDUSTRIAL ACTION”, it doesn't make sense. So it must be some word that “INDUSTRIAL ACTION” cues. \nIt's still not quite clear what the answer can be. Let’s think from another direction: If we think about it:\n1. The answer is a  “A SCANDINAVIAN PORT” \n2. The answer is one word with 4 letters\nThen we can think of the word “OSLO”. Then if we associate it with *endless* “INDUSTRIAL ACTION”, we can see that “INDUSTRIAL ACTION” can cue “GO-SLOW”, and if we remove the first and last letter, we will get “OSLO”, which is “A SCANDINAVIAN PORT”\n**STEP 5**:  \nWe will check if the answer we found is correct. FIRST, it fits the enumeration, because “OSLO” is indeed one word with 4 letters.  SECOND, The word “OSLO” is a meaningful word and fits the definition “A SCANDINAVIAN PORT”. \nSo the answer is **OSLO**"}
{"clue": "What’s tedious and instils such listlessness? Every second of this (5)", "orientation": "down", "quick": true, "input": "**Clue**: What’s tedious and instils such listlessness? Every second of this (5)\n**Orientation**: down", "explanation": "**Clue**: What’s tedious and instils such listlessness? Every second of this (5)\n**STEP 1**:\nWe will start by identifying the type of the puzzle. We can guess that the clue tells us it’s *every second of* “WHAT’S TEDIOUS AND INSTILS SUCH LISTLESSNESS”. The phrase “EVERY SECOND OF THIS” suggests that this puzzle is a Letter Manipulation - Concatenation type puzzle. That means we need to figure out what to do. “EVERY SECOND OF THIS” could mean that we need to take the second letter of each word in the wordplay word in order to form the answer. “THIS” might refer to the clue itself. \n**STEP 2**:\nWe will then find the definition. Although the definition is almost always either at the beginning or end of the clue sentence or phrase, we see that the clue is a short sentence that is a clear description of something. So this may be a “&lit” typed puzzle, and the definition will overlap with the wordplay, in this case, the definition is the first sentence:  “WHAT’S TEDIOUS AND INSTILS SUCH LISTLESSNESS?”.\n**STEP 3**: \nWe will look at the word length of the answer. The enumeration suggests that the answer will be one word that is 5 letters long. \n**STEP 4**: \nWe will solve the puzzle by following the plan we made in STEP 1: We know “WHAT’S TEDIOUS AND INSTILS SUCH LISTLESSNESS?” is the definition, and “EVERY SECOND OF THIS”  is the indicator. But since it's a “&lit” type of problem, the definition will overlap with the wordplay. The clue tells us it’s *every second of* “WHAT’S TEDIOUS AND INSTILS SUCH LISTLESSNESS”. we will take the second letters of each word in it, and we get “HENNUI”. This word is 6 letters long and it’s not meaningful. However, “ENNUI” fits the definition “WHAT’S TEDIOUS AND INSTILS SUCH LISTLESSNESS?”, and it’s 5 letters long. And “ENNUI” is *every second of* “TEDIOUS AND INSTILS SUCH LISTLESSNESS” (without the word “WHAT’S” in the clue). \nSo “ENNUI” could be the answer. \n**STEP 5**:  \nWe will check if the answer we found is correct. FIRST, it fits the enumeration, because “ENNUI” is indeed one word with 5 letters.  SECOND, The word “ENNUI” is a meaningful word and fits the definition “WHAT’S TEDIOUS AND INSTILS SUCH LISTLESSNESS?”. \nSo the answer is **ENNUI**"}
{"clue": "Robin’s slayer uses extremely sharp weapon (7)", "orientation": "down", "quick": true, "input": "**Clue**: Robin’s slayer uses extremely sharp weapon (7)\n**Orientation**: down", "explanation": "**Clue**: Robin’s slayer uses extremely sharp weapon (7)\n**STEP 1**:\nWe will start by identifying the type of the puzzle. We can guess that the clue tells us to *uses* *extreme* of “SHARP” “WEAPON”. The word “EXTREMELY” suggests that this puzzle is a Letter Manipulation - Concatenation type puzzle. That means we need to figure out what to do. “EXTREMELY” could mean that we need to take the first and last letter of the wordplay word in order to form the answer. Since the first and last letter are the *extremes* of the wordplay word. **STEP 2**:\nWe will then find the definition. Since the definition is almost always either at the beginning or end of the clue sentence or phrase, we will assume “ROBIN’S SLAYER” is the definition.\n**STEP 3**: \nWe will look at the word length of the answer. The enumeration suggests that the answer will be one word that is 7 letters long. \n**STEP 4**: \nWe will solve the puzzle by following the plan we made in STEP 1:\nFirst, we need to find the wordplay word. Consider “ROBIN’S SLAYER” is the definition and “EXTREMELY” is the indicator. “USES” is probably a linkword. Then we probably should look at the rest of the sentence. The clue tells us to *uses* *extreme* of “SHARP” “WEAPON”. \nIf we take the first and last letter from “SHARP”, We will get “SP” \nIt's still not quite clear what the answer can be. Let’s think from another direction: If we think about it:\n1. The answer is a  “ROBIN’S SLAYER” \n2. The answer is one word with 7 letters\n3. The answer could start with “SP”\nThen we can think of the word “SPARROW”. Which is adding “SP” to “ARROW”. Then if we associate it with “WEAPON”, we can see that “WEAPON” can cue “ARROW”. And if we combine “SP” and “ARROW” together, we get “SPARROW”, which is a “ROBIN’S SLAYER”\n**STEP 5**:  \nWe will check if the answer we found is correct. FIRST, it fits the enumeration, because “SPARROW” is indeed one word with 7 letters.  SECOND, The word “SPARROW” is a meaningful word and fits the definition “ROBIN’S SLAYER”. \nSo the answer is **SPARROW**"}
{"clue": "It’s crazy changing what comes before pi (7)", "orientation": "down", "quick": false, "input": "**Clue**: It’s crazy changing what comes before pi (7)\n**Orientation**: down", "explanation": "**Clue**: It’s crazy changing what comes before pi (7)\n**STEP 1**:\nWe will start by identifying the type of the puzzle. We can guess that the clue tells us to *change* “WHAT COMES BEFORE PI”. The word “CHANGING” suggests that this puzzle is an Anagram type puzzle. That means we need to shuffle the letters of the wordplay words to form the answer. The wordplay words to shuffle (the anagram fodder) can be word or phrase directly from the clue, or it could be indirect and cued by some words or phrase in the clue. \n**STEP 2**:\nWe will then find the definition. Since the definition is almost always either at the beginning or end of the clue sentence or phrase, we will assume “IT’S CRAZY” is the definition.\n**STEP 3**: \nWe will look at the word length of the answer. The enumeration suggests that the answer will be one word that is 7 letters long. \n**STEP 4**: \nWe will solve the puzzle by following the plan we made in STEP 1: since it’s an Anagram type puzzle, we will try to find the anagram fodder. We know that “IT’S CRAZY” is the definition and “CHANGING” is the indicator, then we probably should find the anagram fodder in the rest of the sentence. The clue tells us to *change* “WHAT COMES BEFORE PI”.\n1. We will see if there is a word or phrase in the clue, that is 7 letters long, so we can rearrange the letters and get the answer. There seems to be no phrase that is 7 letters for us to shuffle. \n2. Then we will consider the possibility that the wordplay word is cued by the clue. “WHAT COMES BEFORE PI” can cue “OMICRON” in Greek Alphabet. “OMICRON” happens to be 7 letters. \n“OMICRON” contains the letters “O M I C R O N”. We know that the definition is “IT’S CRAZY”, so if we take a scan of the letters, we see that the letters can form the word “MORONIC”, which fits the definition “IT’S CRAZY”. \n**STEP 5**:  \nWe will check if the answer we found is correct. FIRST, it fits the enumeration, because “MORONIC” is indeed one word with 7 letters.  SECOND, The word “MORONIC” is a meaningful word and fits the definition “IT’S CRAZY”. \nSo the answer is **MORONIC**"}
{"clue": "Farewell horrid lepidoptera - none seen for ages (6-3)", "orientation": "down", "quick": false, "input": "**Clue**: Farewell horrid lepidoptera - none seen for ages (6-3)\n**Orientation**: down", "explanation": "**Clue**: Farewell horrid lepidoptera - none seen for ages (6-3)\n**STEP 1**:\nWe will start by identifying the type of the puzzle. \nWe can guess that the clue tells us to *horrid* “LEPIDOPTERA”. The word “HORRID” suggests that this puzzle is an Anagram type puzzle. That means we need to shuffle the letters of the wordplay words to form the answer. The wordplay words to shuffle (the anagram fodder) can be word or phrase directly from the clue, or it could be indirect and cued by some words or phrase in the clue. \nWe can guess that the clue tells us “NONE” is *seen for (instead of)* “AGES”. The phrase “NONE SEEN FOR AGES” suggests that this puzzle is a Letter Manipulation - Replacing Letter type puzzle. That means we will first find the wordplay word, and the letter to switch, then we will switch the letter in the wordplay word to get the answer. In particular, the phrase “X SEEN FOR X” suggests that after we found the wordplay word, and the letter to switch, we are replacing the letter to switch in the wordplay word. \nSo there are two types of puzzles in this clue: Anagram and Letter Manipulation. So our plan is to first find the anagram fodder (the wordplay word), and then find the letter to switch, and then perform anagram to get the answer. \n**STEP 2**:\nWe will then find the definition. Since the definition is almost always either at the beginning or end of the clue sentence or phrase, we will assume “FAREWELL” is the definition.\n**STEP 3**: \nWe will look at the word length of the answer. The enumeration suggests that the answer will be one word that is 6 letters and 3 letters connected by “-”. \n**STEP 4**: \nWe will solve the puzzle by following the plan we made in STEP 1: \nFirst of all, since there are two types of puzzles in the clue, we might want to start with a bit of imagination. Let’s think from another direction: If we think about it:\n1. The answer is synonym of  “FAREWELL” \n2. The answer is one word that is 6 letters and 3 letters connected by “-”.\nWe can think of the phrase “TOODLE-PIP”, which is a British humorous term for “FAREWELL”.\nNow let’s look from the original direction (by following the plan we made in STEP 1): \nSince it’s an Anagram type puzzle, we will try to find the anagram fodder. We know that “FAREWELL” is the definition and “HORRID” is the indicator for Anagram, then we probably should find the anagram fodder in the rest of the sentence. The clue tells us to *horrid* “LEPIDOPTERA”. So we assume that “LEPIDOPTERA” is the word we want to anagram. \nSince “LEPIDOPTERA” is the word we want to anagram, and “X SEEN FOR X\" is the indicator for Letter Manipulation, then we probably should look at the rest of the sentence. The clue tells us “NONE” is *seen for (instead of)* “AGES”, so we can see that \n1. “NONE” usually cues “O” in cryptic crosswords.  \n2. We don’t see “AGES” in “LEPIDOPTERA”, but we see “ERA” in “LEPIDOPTERA”. So it makes sense now: “AGES” cues “ERA”. \nThen we can conclude that we are replacing “ERA” to “O” in “LEPIDOPTERA”, so we have letters “L E P I D O P T O”.\nWe know that the definition is “FAREWELL”, so if we take a scan of the letters, we see that the letters can form the word “TOODLE-PIP”, which fits the definition “FAREWELL”. \n**STEP 5**:  \nWe will check if the answer we found is correct. FIRST, it fits the enumeration, because “TOODLE-PIP” is indeed one word that is 6 letters and 3 letters connected by “-”.  SECOND, The word “TOODLE-PIP” is a meaningful word and fits the definition “FAREWELL”. \nSo the answer is **TOODLE-PIP**"}
{"clue": "Aspiring to achieve first in Wimbledon, double-faulted (5-2)", "orientation": "down", "quick": false, "input": "**Clue**: Aspiring to achieve first in Wimbledon, double-faulted (5-2)\n**Orientation**: down", "explanation": "**Clue**: Aspiring to achieve first in Wimbledon, double-faulted (5-2)\n**STEP 1**:\nWe will start by identifying the type of the puzzle. \nWe can guess that the clue tells us “DOUBLE” *(is) faulted*. The word “FAULTED” suggests that this puzzle is an Anagram type puzzle. That means we need to shuffle the letters of the wordplay words to form the answer. The wordplay words to shuffle (the anagram fodder) can be word or phrase directly from the clue, or it could be indirect and cued by some words or phrase in the clue. \nWe can guess that the clue tells us *first in* “WIMBLEDON”. The phrase “FIRST IN” suggests that this puzzle is a Letter Manipulation - Concatenation puzzle. That means the wordplay word contains a letter from the initial letter of a word in the clue. “IN” here is probably a link word. \nSo there are two types of puzzles in this clue: Anagram and Letter Manipulation. So our plan is to first find the anagram fodder (the wordplay word), and then find the initial letter, and then since it’s an anagram type puzzle, we are shuffling letters, so we probably should add the initial letters to the wordplay letters to get all the letters to shuffle, and then perform anagram to get the answer. \n**STEP 2**:\nWe will then find the definition. Since the definition is almost always either at the beginning or end of the clue sentence or phrase, we will assume “ASPIRING TO ACHIEVE” is the definition.\n**STEP 3**: \nWe will look at the word length of the answer. The enumeration suggests that the answer will be one word that is 5 letters and 2 letters connected by “-”. \n**STEP 4**: \nWe will solve the puzzle by following the plan we made in STEP 1: \nSince it’s an Anagram type puzzle, we will try to find the anagram fodder. We know that “ASPIRING TO ACHIEVE” is the definition and “FAULTED” is the indicator for Anagram, then we probably should find the anagram fodder in the rest of the sentence. The clue tells us “DOUBLE” *(is) faulted*. So we assume that “DOUBLE” is the word we want to anagram. \nSince “DOUBLE” is the word we want to anagram, and “FIRST IN\" is the indicator for Letter Manipulation - Concatenation, then we probably should look at the rest of the sentence. The clue tells us *first in* “WIMBLEDON”, so we probably should take the initial letter “W” of “WIMBLEDON”. \nThen we can conclude that we are adding “W” to “DOUBLE”, so we have letters “W D O U B L E”.\nIt's still not quite clear what the answer can be. Let’s think from another direction: If we think about it:\n1. The answer is synonym of  “ASPIRING TO ACHIEVE” \n2. The answer is one word that is 5 letters and 2 letters connected by “-”\n3. We have letters “W D O U B L E” to perform anagram.\nwe would think about the word “WOULD-BE”. which fits the definition “ASPIRING TO ACHIEVE”. \n**STEP 5**:  \nWe will check if the answer we found is correct. FIRST, it fits the enumeration, because “WOULD-BE” is indeed one word that is 5 letters and 2 letters connected by “-”.  SECOND, The word “WOULD-BE” is a meaningful word and fits the definition “ASPIRING TO ACHIEVE”. \nSo the answer is **WOULD-BE**"}
{"clue": "Neglectful having left off dicky bow (9)", "orientation": "across", "quick": false, "input": "**Clue**: Neglectful having left off dicky bow (9)\n**Orientation**: across", "explanation": "**Clue**: Neglectful having left off dicky bow (9)\n**STEP 1**:\nWe will start by identifying the type of the puzzle. \nWe can guess that the clue tells us “NEGLECTFUL HAVING LEFT OFF ” *(is) dicky*. The word “DICKY” suggests that this puzzle is an Anagram type puzzle. That means we need to shuffle the letters of the wordplay words to form the answer. The wordplay words to shuffle (the anagram fodder) can be word or phrase directly from the clue, or it could be indirect and cued by some words or phrase in the clue. \nWe can guess that the clue tells us *having* “LEFT” *off*. The phrase “HAVING LEFT OFF” (or “HAVING X OFF”) suggests that this puzzle is a Letter Manipulation - Deletion type puzzle. That means we are deleting something from the wordplay word. \nSo there are two types of puzzles in this clue: Anagram and Letter Manipulation. So our plan is to first find the anagram fodder (the wordplay word), and then find the letter to delete, delete the letter from all the letters to shuffle, and then perform anagram to get the answer. \n**STEP 2**:\nWe will then find the definition. Since the definition is almost always either at the beginning or end of the clue sentence or phrase, we will assume “BOW” is the definition.\n**STEP 3**: \nWe will look at the word length of the answer. The enumeration suggests that the answer will be one word that is 9 letters long. \n**STEP 4**: \nWe will solve the puzzle by following the plan we made in STEP 1: \nSince it’s an Anagram type puzzle, we will try to find the anagram fodder. We know that “BOW” is the definition and “DICKY” is the indicator for Anagram, then we probably should find the anagram fodder in the rest of the sentence. The clue tells us “NEGLECTFUL HAVING LEFT OFF ” *(is) dicky*. However, we know that “HAVING LEFT OFF” is part of the Letter Manipulation puzzle, so we assume that the clue tells us “NEGLECTFUL (HAVING LEFT OFF) ” *(is) dicky*. So “NEGLECTFUL” is the word we want to anagram. \nSince “NEGLECTFUL” is the word we want to anagram, and “HAVING X OFF\" is the indicator for Letter Manipulation - Deletion, then we probably should look at the rest of the sentence. The clue tells us *having* “LEFT” *off*: “LEFT” often cues “L” in cryptic crosswords, so this is probably suggesting us to remove the letter “L” from the wordplay letters. \nThen we can conclude that we are removing one “L” from “NEGLECTFUL”, so we have letters “N E G E C T F U L”, which is also 9 letters, so it suits the enumeration. \nIt's still not quite clear what the answer can be. Let’s think from another direction: If we think about it:\n1. The answer is synonym of  “BOW” \n2. The answer is one word 9 letters long\n3. We have letters “N E G E C T F U L” to perform anagram.\nwe would think about the word “GENUFLECT”. which fits the definition “BOW”. \n**STEP 5**:  \nWe will check if the answer we found is correct. FIRST, it fits the enumeration, because “GENUFLECT” is indeed one word 9 letters long.  SECOND, The word “GENUFLECT” is a meaningful word and fits the definition “BOW”. \nSo the answer is **GENUFLECT**"}
{"clue": "Nothing stops Chelsea playing tie (8)", "orientation": "down", "quick": false, "input": "**Clue**: Nothing stops Chelsea playing tie (8)\n**Orientation**: down", "explanation": "**Clue**: Nothing stops Chelsea playing tie (8)\n**STEP 1**:\nWe will start by identifying the type of the puzzle. We can guess that the clue tells us that “NOTHING” *stops (in the middle of)* “CHELSEA”. The word “STOPS” suggests that this puzzle is a Sandwich type puzzle. That means we need to find two sets of wordplay words, and we will split one wordplay word and stuff the other wordplay word inside of it to form the answer. \nAlso the word “PLAYING” suggests that this puzzle is an Anagram type puzzle. That means we need to shuffle the letters of the wordplay words to form the answer. The wordplay words to shuffle (the anagram fodder) can be word or phrase directly from the clue, or it could be indirect and cued by some words or phrase in the clue.\nSo there are two types of puzzles in this clue: Sandwich and Anagram. So our plan is to first find the pair of wordplay words to perform a sandwich operation, and then we take the sandwiched wordplay word, and perform anagram to get the answer. \n**STEP 2**:\nWe will then find the definition. Since the definition is almost always either at the beginning or end of the clue sentence or phrase, we will assume “TIE” is the definition.\n**STEP 3**: \nWe will look at the word length of the answer. The enumeration suggests that the answer will be one word that is 8 letters long. \n**STEP 4**: \nWe will solve the puzzle by following the plan we made in STEP 1: \nSince it’s a Sandwich type puzzle, we will first find the two sets of wordplay words. We know that “TIE” is the definition and “STOPS” is the indicator. The clue tells us that “NOTHING” *stops (in the middle of)* “CHELSEA”. We know that “NOTHING” usually cues “O” in cryptic crosswords, so let’s try to stuff “O” in “CHELSEA”, and we will have letters “C H E O L S E A”.\nNow we will perform anagram on these letters: \nIt's still not quite clear what the answer can be. Let’s think from another direction: If we think about it:\n1. The answer is synonym of  “TIE” \n2. The answer is one word 8 letters long\n3. We have letters “C H E O L S E A” to perform anagram.\nwe would think about the word “SHOELACE”. which fits the definition “TIE”. \n**STEP 5**:  \nWe will check if the answer we found is correct. FIRST, it fits the enumeration, because “SHOELACE” is indeed one word with 8 letters.  SECOND, The word “SHOELACE” is a meaningful word and fits the definition “TIE”. \nSo the answer is **SHOELACE**"}
{"clue": "Rather restricting the setter? I don’t care! (8)", "orientation": "across", "quick": false, "input": "**Clue**: Rather restricting the setter? I don’t care! (8)\n**Orientation**: across", "explanation": "**Clue**: Rather restricting the setter? I don’t care! (8)\n**STEP 1**:\nWe will start by identifying the type of the puzzle. We can guess that the clue tells us that we are *restricting* “THE SETTER” (in) “I DON’T CARE”. The word “RESTRICTING” suggests that this puzzle is a Sandwich type puzzle. That means we need to find two sets of wordplay words, and we will split one wordplay word and stuff the other wordplay word inside of it to form the answer. \n**STEP 2**:\nWe will then find the definition. Since the definition is almost always either at the beginning or end of the clue sentence or phrase, we will assume “RATHER” is the definition.\n**STEP 3**: \nWe will look at the word length of the answer. The enumeration suggests that the answer will be one word that is 8 letters long. \n**STEP 4**: \nWe will solve the puzzle by following the plan we made in STEP 1: since it’s a Sandwich type puzzle, we will first find the two sets of wordplay words. We know that “RATHER” is the definition and “RESTRICTING” is the indicator. The clue tells us that we are *restricting* “THE SETTER” (in) “I DON’T CARE”.\nFirst of all, in cryptic crossword terminologies, “SETTER” is the person who creates the puzzles. So when the setter uses the phrase “THE SETTER”, it can cue “ME” as he is referring to himself. \nIt's still not quite clear what the answer can be. Let’s think from another direction: If we think about it:\n1. The answer is synonym of  “RATHER” \n2. The answer is one word with 8 letters\n3. We are stuffing “ME” into something\nwe would think about the word “SOMEWHAT”. Which is stuffing “ME” into “SO WHAT”. And “I DON’T CARE” can reasonably cue “SO WHAT”. \nSo we may conclude that “THE SETTER” cues “ME” and “I DON’T CARE” cues “SO WHAT”. And we stuff “ME” into “SO WHAT” to get “SOMEWHAT”, which fits the definition “RATHER”.\n**STEP 5**:  \nWe will check if the answer we found is correct. FIRST, it fits the enumeration, because “SOMEWHAT” is indeed one word with 8 letters.  SECOND, The word “SOMEWHAT” is a meaningful word and fits the definition “RATHER”. \nSo the answer is **SOMEWHAT**"}
{"clue": "Fall in love? On the contrary, wilt (5)", "orientation": "across", "quick": false, "input": "**Clue**: Fall in love? On the contrary, wilt (5)\n**Orientation**: across", "explanation": "**Clue**: Fall in love? On the contrary, wilt (5)\n**STEP 1**:\nWe will start by identifying the type of the puzzle. We can guess that the clue tells us that we are putting “FALL” *in* “LOVE”. The word “IN” suggests that this puzzle is a Sandwich type puzzle (“IN” is not a linkword here). That means we need to find two sets of wordplay words, and we will split one wordplay word and stuff the other wordplay word inside of it to form the answer. \n**STEP 2**:\nWe will then find the definition. Since the definition is almost always either at the beginning or end of the clue sentence or phrase, we will assume “WILT” is the definition.\n**STEP 3**: \nWe will look at the word length of the answer. The enumeration suggests that the answer will be one word that is 5 letters long. \n**STEP 4**: \nWe will solve the puzzle by following the plan we made in STEP 1: since it’s a Sandwich type puzzle, we will first find the two sets of wordplay words. We know that “WILT” is the definition and “IN” is the indicator. The clue tells us that we are putting “FALL” *in* “LOVE”. However, we see that there is a part of the clue we haven’t used yet: “ON THE CONTRARY”. This shows that maybe we should do the reverse, we should put “LOVE” *in* “FALL”. \nFirst of all, “FALL” could cue “DROP”. \nIt's still not quite clear what the answer can be. Let’s think from another direction: If we think about it:\n1. The answer is synonym of  “WILT” \n2. The answer is one word with 5 letters\n3. We are stuffing something into “DROP” to form the answer. \nwe would think about the word “DROOP”. Which is stuffing “O” into “DROP”. And “LOVE” can reasonably cue “O” as in tennis, “LOVE” means zero, and zero cues “O” in cryptic puzzles very often. \nSo we may conclude that “LOVE” cues “O” and “FALL” cues “DROP”. And we stuff “O” into “DROP” to get “DROOP”, which fits the definition “WILT”.\n**STEP 5**:  \nWe will check if the answer we found is correct. FIRST, it fits the enumeration, because “DROOP” is indeed one word with 5 letters.  SECOND, The word “DROOP” is a meaningful word and fits the definition “WILT”. \nSo the answer is **DROOP**"}
{"clue": "Composer of lines for Soviet city (8)", "orientation": "across", "quick": false, "input": "**Clue**: Composer of lines for Soviet city (8)\n**Orientation**: across", "explanation": "**Clue**: Composer of lines for Soviet city (8)\n**STEP 1**:\nWe will start by identifying the type of the puzzle. We can guess that the clue tells us that “OF” *lines (is inside of)* “FOR SOVIET CITY”. The word “LINES” suggests that this puzzle is a Sandwich type puzzle. “LINES” means something is inside of another, this is an unusual indicator. That means we need to find two sets of wordplay words, and we will split one wordplay word and stuff the other wordplay word inside of it to form the answer. \n**STEP 2**:\nWe will then find the definition. Since the definition is almost always either at the beginning or end of the clue sentence or phrase, we will assume “COMPOSER” is the definition.\n**STEP 3**: \nWe will look at the word length of the answer. The enumeration suggests that the answer will be one word that is 8 letters long. \n**STEP 4**: \nWe will solve the puzzle by following the plan we made in STEP 1: \nSince it’s a Sandwich type puzzle, we will first find the two sets of wordplay words. We know that “COMPOSER” is the definition and “LINES” is the indicator. The clue tells us that “OF” *lines (is inside of)* “FOR SOVIET CITY”. \nFirst of all, “SOVIET CITY” could cue “KIEV”, “FOR” could cue “PRO”, and we probably can take “OF” as it is. \nIt's still not quite clear what the answer can be. Let’s think from another direction: If we think about it:\n1. The answer is a “COMPOSER” \n2. The answer is one word with 8 letters\n3. We are putting “OF” in side “PRO” and “KIEV”\nThen we can think of the composer “PROKOFIEV”. And indeed, we are putting “OF” inside the combined letter “PROKIEV”.\nSo we conclude that “SOVIET CITY” cues “KIEV”, “FOR” cues “PRO”, and we put “OF” inside the combined letter “PROKIEV” to form “PROKOFIEV”, which is a “COMPOSER” and contains 8 letters. \n**STEP 5**:  \nWe will check if the answer we found is correct. FIRST, it fits the enumeration, because “PROKOFIEV” is indeed one word with 8 letters.  SECOND, The word “PROKOFIEV” is a meaningful word and fits the definition “COMPOSER”. \nSo the answer is **PROKOFIEV**"}
{"clue": "Check reported weather forecast perhaps (4)", "orientation": "across", "quick": false, "input": "**Clue**: Check reported weather forecast perhaps (4)\n**Orientation**: across", "explanation": "**Clue**: Check reported weather forecast perhaps (4)\n**STEP 1**:\nWe will start by identifying the type of the puzzle. The word “REPORTED” suggests that this puzzle is a Homophone type puzzle. That means we need to find a wordplay word, so that the answer fits the enumeration, sounds like the wordplay words, and fits the definition.\n**STEP 2**:\nWe will then find the definition. Since the definition is almost always either at the beginning or end of the clue sentence or phrase, we will assume “CHECK” is the definition. Because “REPORTEDLY” is not likely the definition. \n**STEP 3**: \nWe will look at the word length of the answer. The enumeration suggests that the answer will be one word that is 4 letters long. \n**STEP 4**: \nWe will solve the puzzle by following the plan we made in STEP 1: since it’s a Homophone type puzzle, we need to find the wordplay word that the answer will sound like. Since “CHECK” is the definition, and “REPORTED” is the indicator, what’s left in the clue is “WEATHER FORECAST PERHAPS”. \nFrom one direction, we will try to see what can we get from the clue “WEATHER FORECAST PERHAPS”\n1. First we see if there are any words that sound like “WEATHER”, “FORECAST” and “PERHAPS”? We can’t think of any. \n2. Then we see if we can find the wordplay word from “WEATHER FORECAST PERHAPS”. \nA “WEATHER FORECAST PERHAPS” could mean “RAIN”?\nIt's still not quite clear what the answer can be. Let’s think from another direction: If we think about it:\n1. The answer is synonym of  “CHECK” \n2. The answer is one word with 4 letters\n3. The answer sounds like “RAIN”\nWe may think of the word “REIN”. \nAnd indeed,“REIN”, sounds like “RAIN”, and “REIN” fits under the definition “CHECK”. \n**STEP 5**:  \nWe will check if the answer we found is correct. FIRST, it fits the enumeration, because “REIN” is indeed one word with 4 letters.  SECOND, The word “REIN” is a meaningful word and fits the definition “CHECK”. \nSo the answer is **REIN**"}
{"clue": "It’s said to include part of circuit (7)", "orientation": "across", "quick": false, "input": "**Clue**: It’s said to include part of circuit (7)\n**Orientation**: across", "explanation": "**Clue**: It’s said to include part of circuit (7)\n**STEP 1**:\nWe will start by identifying the type of the puzzle. We can guess that the clue tells us that *it is* “SAID” *to include* “PART”. The word “SAID” seems to suggest that this puzzle is a Homophone type puzzle, but it’s actually the word “INCLUDE” that suggests that it’s a Sandwich type puzzle. That means we need to find two sets of wordplay words, and we will split one wordplay word and stuff the other wordplay word inside of it to form the answer. \n**STEP 2**:\nWe will then find the definition. Since the definition is almost always either at the beginning or end of the clue sentence or phrase, we will assume “OF CIRCUIT” is the definition.\n**STEP 3**: \nWe will look at the word length of the answer. The enumeration suggests that the answer will be one word that is 7 letters long. \n**STEP 4**: \nWe will solve the puzzle by following the plan we made in STEP 1: since it’s a Sandwich type puzzle, we will first find the two sets of wordplay words. We know that “OF CIRCUIT” is the definition and “INCLUDE” is the indicator. The clue tells us that *it is* “SAID” *to include* “PART”, so the wordplay from “SAID” will be outside the wordplay of “PART”.\n“SAID” could cue “ORAL”.\nIt's still not quite clear what the answer can be. Let’s think from another direction: If we think about it:\n1. The answer is synonym of  “OF CIRCUIT” \n2. The answer is one word with 7 letters\n3. We will put some word inside the letters “O R A L”\nwe would think about the word “ORBITAL”: which is putting the word “BIT” inside of “ORAL”. And indeed, “PART” can reasonably cue “BIT”. \nSo we conclude that “SAID” cues “ORAL”, “PART” cues “BIT” and we will put “ORAL” outside of “BIT” to make it “ORBITAL”, which fits the definition “OF CIRCUIT”. \n**STEP 5**:  \nWe will check if the answer we found is correct. FIRST, it fits the enumeration, because “ORBITAL” is indeed one word with 7 letters.  SECOND, The word “ORBITAL” is a meaningful word and fits the definition “OF CIRCUIT”. \nSo the answer is **ORBITAL**"}
{"clue": "Zip fastener gymnast employs (6)", "orientation": "down", "quick": false, "input": "**Clue**: Zip fastener gymnast employs (6)\n**Orientation**: down", "explanation": "**Clue**: Zip fastener gymnast employs (6)\n**STEP 1**:\nWe will start by identifying the type of the puzzle. We can guess that the clue tells us the answer is in the “FASTENER GYMNAST” (getting) *employs*. The word “EMPLOYS” suggests that this puzzle is a Hidden Word type puzzle. That means the answer we need to find hides inside the concatenation of the words. We just need to concatenate words in the clue, and find the answer that hides inside of them.\n**STEP 2**:\nWe will then find the definition. Since the definition is almost always either at the beginning or end of the clue sentence or phrase, we will assume “ZIP” is the definition. \n**STEP 3**: \nWe will look at the word length of the answer. The enumeration suggests that the answer will be one word that is 6 letters long. \n**STEP 4**: \nWe will solve the puzzle by following the plan we made in STEP 1: since “ZIP” is the definition, and “EMPLOYS” is the indicator, then we probably should look at the rest of the sentence. Usually the hidden word answer hides at the connection of consecutive words —- it’s made from the end part of a word and the beginning part of the next word. So we will pay more attention to that. \nFirst we will concatenate the rest of the sentence: the clue tells us the answer is in the “FASTENERGYMNAST”. And we are looking for the word that is:\n1. The synonym of “ZIP”\n2. One word with 4 letters long: So we will just scan the concatenate string with a ‘sliding window’ of 4 letters. (“FASTEN”, “ASTENE”, “STENER”, ……)\n3. Likely to hide at the connection place of words.\nWe see that “ARID” in “FAST*ENERGY*MNAST” stands out. And indeed, “ENERGY” fits into the definition “ZIP”\n**STEP 5**:  \nWe will check if the answer we found is correct. FIRST, it fits the enumeration, because “ENERGY” is indeed one word with 6 letters.  SECOND, The word “ENERGY” is a meaningful word and fits the definition “ZIP”. \nSo the answer is **ENERGY**"}
{"clue": "Wine to some extent features in a taverna (8)", "orientation": "across", "quick": false, "input": "**Clue**: Wine to some extent features in a taverna (8)\n**Orientation**: across", "explanation": "**Clue**: Wine to some extent features in a taverna (8)\n**STEP 1**:\nWe will start by identifying the type of the puzzle. We can guess that the clue tells us the answer is *to some extent (in the phrase)* “FEATURESINATAVERNA”. The phrase “TO SOME EXTENT” suggests that this puzzle is a Hidden Word type puzzle. That means the answer we need to find hides inside the concatenation of the words. We just need to concatenate words in the clue, and find the answer that hides inside of them.\n**STEP 2**:\nWe will then find the definition. Since the definition is almost always either at the beginning or end of the clue sentence or phrase, we will assume “WINE” is the definition. \n**STEP 3**: \nWe will look at the word length of the answer. The enumeration suggests that the answer will be one word that is 8 letters long. \n**STEP 4**: \nWe will solve the puzzle by following the plan we made in STEP 1: since “WINE” is the definition, and “TO SOME EXTENT” is the indicator, then we probably should look at the rest of the sentence. Usually the hidden word answer hides at the connection of consecutive words —- it’s made from the end part of a word and the beginning part of the next word. So we will pay more attention to that. \nFirst we will concatenate the rest of the sentence: the clue tells us the answer is in the “FEATURESINATAVERNA”. And we are looking for the word that is:\n1. The synonym of “WINE”\n2. One word with 8 letters long: So we will just scan the concatenate string with a ‘sliding window’ of 8 letters. (“FEATURES”, “EATURESI”, “ATURESIN”, ……)\n3. Likely to hide at the connection place of words.\nWe see that “RESINATA” in “FEATU*RESINATA*VERNA” stands out. And indeed, “RESINATA” fits into the definition “WINE”\n**STEP 5**:  \nWe will check if the answer we found is correct. FIRST, it fits the enumeration, because “RESINATA” is indeed one word with 6 letters.  SECOND, The word “RESINATA” is a meaningful word and fits the definition “WINE”. \nSo the answer is **RESINATA**"}
{"clue": "Swimmer turning in special pool (6)", "orientation": "across", "quick": false, "input": "**Clue**: Swimmer turning in special pool (6)\n**Orientation**: across", "explanation": "**Clue**: Swimmer turning in special pool (6)\n**STEP 1**:\nWe will start by identifying the type of the puzzle. We can guess that the clue tells us the answer is *in* “SPECIAL POOL”. The phrase “IN” suggests that this puzzle is a Hidden Word type puzzle. That means the answer we need to find hides inside the concatenation of the words. We just need to concatenate words in the clue, and find the answer that hides inside of them.\nWe can guess that the clue tells us that the answer is *turning* “IN SPECIAL POOL”. The word “TURNING” suggests that this puzzle is a Reversal type puzzle. That means we will first find the wordplay word to reverse, and then we will reverse the letter of it to get the answer. \nSo there are two types of puzzles in this clue: Hidden Word and Reversal. So our plan is to find the wordsplay phrase, reverse the letters in the wordplay phrase, and then find the answer that is hiding inside. \n**STEP 2**:\nWe will then find the definition. Since the definition is almost always either at the beginning or end of the clue sentence or phrase, we will assume “SWIMMER” is the definition. \n**STEP 3**: \nWe will look at the word length of the answer. The enumeration suggests that the answer will be one word that is 6 letters long. \n**STEP 4**: \nWe will solve the puzzle by following the plan we made in STEP 1: since “SWIMMER” is the definition, and “IN” is the indicator, then we probably should look at the rest of the sentence. \nFrom one direction, we see that the clue tells us the answer is *IN* “SPECIAL POOL”: so we will concatenate it and get “SPECIALPOOL”. \nThen since “SPECIALPOOL” is the wordplay phrase and “TURNING” is the indicator that says it’s a Reversal type, we will reverse the letters in “SPECIALPOOL” and get “LOOPLAICEPS”.\nIt's still not quite clear what the answer can be. Let’s think from another direction: If we think about it:\n1. The answer is a “SWIMMER”\n2. One word with 6 letters long: So we will just scan the concatenate string with a ‘sliding window’ of 4 letters. (“LOOPLA”, “OOPLAI”, “OPLAIC”, ……)\n3. Likely to hide at the connection place of words.\nThen we can think of the word “PLAICE”. And indeed, “PLAICE” is a fish, so it is a “SWIMMER”.\n**STEP 5**:  \nWe will check if the answer we found is correct. FIRST, it fits the enumeration, because “PLAICE” is indeed one word with 6 letters.  SECOND, The word “PLAICE” is a meaningful word and fits the definition “SWIMMER”. \nSo the answer is **PLAICE**"}
{"clue": "From which spectators watch odd parts of their contest (7)", "orientation": "across", "quick": false, "input": "**Clue**: From which spectators watch odd parts of their contest (7)\n**Orientation**: across", "explanation": "**Clue**: From which spectators watch odd parts of their contest (7)\n**STEP 1**:\nWe will start by identifying the type of the puzzle. We can guess that the clue tells us the answer is *odd parts of* “THEIR CONTEST”. The phrase “ODD PART OF” suggests that this puzzle is a Letter Manipulation - Concatenation type puzzle. That means we will take the odd letters to concatenate, and then look if there are words hiding inside the concatenated string..\nWe also guess that the clue tells us the answer is this is *odd parts of* “THEIR” + “CONTEST”. Which means we will add the wordplay words together to form the answer, which means it’s also a Charade (additive) type of question, \nSo there are two types of puzzles in this clue: Letter Manipulation - Concatenation and Charade (additive) . So our plan is to find the odd letters of “THEIR”, and the wordplay word of “CONTEST” and add them together to get the answer. \n**STEP 2**:\nWe will then find the definition. Since the definition is almost always either at the beginning or end of the clue sentence or phrase, we will assume “FROM WHICH SPECTATORS WATCH” is the definition. \n**STEP 3**: \nWe will look at the word length of the answer. The enumeration suggests that the answer will be one word that is 7 letters long. \n**STEP 4**: \nWe will solve the puzzle by following the plan we made in STEP 1: \nThe odd letters of “THEIR” are “T E R”. \nIt's still not quite clear what the answer can be. Let’s think from another direction: If we think about it:\n1. The answer is “FROM WHICH SPECTATORS WATCH” \n2. The answer is one word with 7 letters\n3. The answer starts with “TER”\nwe would think about the word “TERRACE”. Which is “TER” + “RACE”. And indeed, “CONTEST” reasonably cues “RACE”.\nSo to conclude, we will take the odd letters of “THEIR” to get “T E R”, and add it to what  “CONTEST” cues, “RACE”, and we will get “TERRACE”, which fits the definition “FROM WHICH SPECTATORS WATCH”.\n**STEP 5**:  \nWe will check if the answer we found is correct. FIRST, it fits the enumeration, because “TERRACE” is indeed one word with 7 letters.  SECOND, The word “TERRACE” is a meaningful word and fits the definition “FROM WHICH SPECTATORS WATCH”. \nSo the answer is **TERRACE**"}
{"clue": "Not an irreversible mistake (4)", "orientation": "down", "quick": false, "input": "**Clue**: Not an irreversible mistake (4)\n**Orientation**: down", "explanation": "**Clue**: Not an irreversible mistake (4)\n**STEP 1**:\nWe will start by identifying the type of the puzzle. We can guess that the clue tells us the answer is *Not an irreversible*. The phrase “NOT AN IRREVERSIBLE”, which means *reversible*, suggests that this puzzle is a Palindromes type puzzle. That means, we will look at the definition, and the enumeration, and try to think of as many palindromes as possible, and pick the most possible one as our answer. \n**STEP 2**:\nWe will then find the definition. Since the definition is almost always either at the beginning or end of the clue sentence or phrase, we will assume “MISTAKE” is the definition. \n**STEP 3**: \nWe will look at the word length of the answer. The enumeration suggests that the answer will be one word that is 4 letters long. \n**STEP 4**: \nWe will solve the puzzle by following the plan we made in STEP 1: since “MISTAKE” is the definition, and “NOT AN IRREVERSIBLE” is the indicator:\nFirst we will think of some palindromes, including informal or colloquial terms, that could relate to the definition “MISTAKE”:\nBoob, deed, noon.\nThen, we will look at our choices, and “BOOB” stands out because it fits the definition “MISTAKE” the best: Informally it refers to a foolish mistake or blunder.\n**STEP 5**:  \nWe will check if the answer we found is correct. FIRST, it fits the enumeration, because “BOOB” is indeed one word with 7 letters.  SECOND, The word “BOOB” is a meaningful word and fits the definition “MISTAKE”. And, “BOOB” is indeed a palindrome. \nSo the answer is **BOOB**"}
{"clue": "Soldiers go in here when grand old duke changes direction (4)", "orientation": "down", "quick": false, "input": "**Clue**: Soldiers go in here when grand old duke changes direction (4)\n**Orientation**: down", "explanation": "**Clue**: Soldiers go in here when grand old duke changes direction (4)\n**STEP 1**:\nWe will start by identifying the type of the puzzle. We can guess that the clue tells us “GRAND OLD DUKE” *changes direction*. The word “CHANGES DIRECTION” could mean that we are switching “L” and “R”, suggesting that this puzzle is a Letter Manipulation - Replacing type puzzle. That means we will first find the wordplay word, and the letter to switch, then we will switch the letter in the wordplay word to get the answer. In particular, the phrase “CHANGES DIRECTION” suggests that after we found the wordplay word, we are replacing the “L” to “R” (or “R” to “L”) in the wordplay word. \n**STEP 2**:\nWe will then find the definition. Since the definition is almost always either at the beginning or end of the clue sentence or phrase, we will assume “SOLDIERS GO IN HERE” is the definition.\n**STEP 3**: \nWe will look at the word length of the answer. The enumeration suggests that the answer will be one word that is 4 letters long.  \n**STEP 4**: \nWe will solve the puzzle by following the plan we made in STEP 1: \nWe know that the definition is “SOLDIERS GO IN HERE”, and the phrase “CHANGES DIRECTION” is the indicator. So when we look at the rest of the clue, the clue tells us that *when* “GRAND OLD DUKE” *changes direction*. \nConsidering the answer is 4 letters long, “GRAND OLD DUKE” could cue “YORK”, and then if we switch the “R” to “L”, we get “YOLK”. “YOLK” fits the definition “SOLDIERS GO IN HERE” because In the UK, \"soldiers\" refer to strips of buttered toast that are often dipped into a soft-boiled egg.\n**STEP 5**:  \nWe will check if the answer we found is correct. FIRST, it fits the enumeration, because “YOLK” is indeed one word that is 4 letters long.  SECOND, The word “YOLK” is a meaningful word and fits the definition “SOLDIERS GO IN HERE”. \nSo the answer is **YOLK**"}
{"clue": "Stop heading for takeaways! (4)", "orientation": "down", "quick": false, "input": "**Clue**: Stop heading for takeaways! (4)\n**Orientation**: down", "explanation": "**Clue**: Stop heading for takeaways! (4)\n**STEP 1**:\nWe will start by identifying the type of the puzzle. We can guess that the clue tells us the answer is *heading for* “TAKEAWAYS”. The phrase “HEADING” suggests that this puzzle is a Letter Manipulation - Concatenation type puzzle. “FOR” is probably a linkword. That means we will take the initial letters of “TAKEAWAYS”.\nWe also guess that the clue tells us the answer is this is “STOP” + *heading for* “TAKEAWAYS”. Which means we will add the wordplay words together to form the answer, which means it’s also a Charade (additive) type of question, \nSo there are two types of puzzles in this clue: Letter Manipulation - Concatenation and Charade (additive) . So our plan is to find the wordplay word of “STOP”, and then the initial letters of “TAKEAWAYS”, and add them together to get the answer. \n**STEP 2**:\nWe will then find the definition. Although the definition is almost always either at the beginning or end of the clue sentence or phrase, we see that the clue is a short sentence that is a clear description of something. And usually the clue ends in “!”, which is a common indicator for a “&lit” type puzzle. So this may be a “&lit” typed puzzle, and the definition will overlap with the wordplay, in this case the definition can be the entire sentence: “STOP HEADING FOR TAKEAWAYS”. \n**STEP 3**: \nWe will look at the word length of the answer. The enumeration suggests that the answer will be one word that is 4 letters long. \n**STEP 4**: \nWe will solve the puzzle by following the plan we made in STEP 1: \nWe know that the initial letters for “TAKEAWAYS” are “T”, but we need to think of the wordplay word for “STOP”, so that we can add “T” to it at the end. \nIt's still not quite clear what the answer can be. Let’s think from another direction: If we think about it:\n1. The answer is “STOP HEADING FOR TAKEAWAYS” \n2. The answer is one word with 4 letters\n3. The answer ends with “T”\nwe would think about the word “DIET”. Which is “DIE” + “T”. And indeed, “STOP” reasonably cues “DIE”.\nSo to conclude, “STOP” cues “DIE”. and the initial letter for “TAKEAWAYS” is “T”, and we add them together to form “DIET”, which fits the definition “STOP HEADING FOR TAKEAWAYS!”\n**STEP 5**:  \nWe will check if the answer we found is correct. FIRST, it fits the enumeration, because “DIET” is indeed one word with 7 letters.  SECOND, The word “DIET” is a meaningful word and fits the definition “STOP HEADING FOR TAKEAWAYS”. \nSo the answer is **DIET**"}
{"clue": "What could give actors no end of cachet? (5)", "orientation": "across", "quick": false, "input": "**Clue**: What could give actors no end of cachet? (5)\n**Orientation**: across", "explanation": "**Clue**: What could give actors no end of cachet? (5)\n**STEP 1**:\nWe will start by identifying the type of the puzzle. \nWe can guess that the clue tells us *could give (by)* “ACTORS”. The phrase “COULD GIVE” suggests that this puzzle is an Anagram type puzzle. That means we need to shuffle the letters of the wordplay words to form the answer. The wordplay words to shuffle (the anagram fodder) can be word or phrase directly from the clue, or it could be indirect and cued by some words or phrase in the clue. \nWe can guess that the clue tells us *no* *end of* “CACHET”. The phrase “NO END OF” suggests that this puzzle is a Letter Manipulation - Deletion type puzzle. That means we are deleting something from the wordplay word. So we need to find the wordplay word, and find what should be deleted from the wordplay word. In this case, the thing to delete is probably *end of* “CACHET”.\nSo there are two types of puzzles in this clue: Anagram and Letter Manipulation - Deletion. So our plan is to first find the anagram fodder (the wordplay word), and then find the parts to delete, and then perform anagram to get the answer. \n**STEP 2**:\nWe will then find the definition. Although the definition is almost always either at the beginning or end of the clue sentence or phrase, we see that the clue is a short sentence that is a clear description of something. And usually the clue ends in “?”, which is a common indicator for a “&lit” type puzzle. So this may be a “&lit” typed puzzle, and the definition will overlap with the wordplay, in this case the definition can be the entire sentence: “WHAT COULD GIVE ACTORS NO END OF CACHET?”. \n**STEP 3**: \nWe will look at the word length of the answer. The enumeration suggests that the answer will be one word that is 5 letters long. \n**STEP 4**: \nWe will solve the puzzle by following the plan we made in STEP 1: \nSince it’s an Anagram type puzzle, we will try to find the anagram fodder. We know that “WHAT COULD GIVE ACTORS NO END OF CACHET?” is the definition and “COULD GIVE” is the indicator for Anagram, then we probably should find the anagram fodder in the rest of the sentence. The clue tells us *could give (by)* “ACTORS”. So we assume that “ACTORS” is the word we want to anagram. \nSince “ACTORS” is the word we want to anagram, and “NO END OF\" is the indicator for Letter Manipulation - Deletion, then we probably should look at the rest of the sentence. The clue tells us *end of* “CACHET”, so we probably should take the final letter “T” of “CACHET”. \nThen we can conclude that we are removing “T” from “ACTORS”, so we have letters “A C O R S”.\nIt's still not quite clear what the answer can be. Let’s think from another direction: If we think about it:\n1. The answer is the answer to  “WHAT COULD GIVE ACTORS NO END OF CACHET?”\n2. The answer is one word that is 5 letters long. \n3. We have letters “A C O R S” to perform anagram.\nwe would think about the word “OSCAR”. which fits the definition “WHAT COULD GIVE ACTORS NO END OF CACHET?”. \n**STEP 5**:  \nWe will check if the answer we found is correct. FIRST, it fits the enumeration, because “OSCAR” is indeed one word that is 5 letters and 2 letters connected by “-”.  SECOND, The word “OSCAR” is a meaningful word and fits the definition “WHAT COULD GIVE ACTORS NO END OF CACHET?”. \nSo the answer is **OSCAR**"}
{"clue": "They’re found in returning perhaps to origins (5)", "orientation": "down", "quick": false, "input": "**Clue**: They’re found in returning perhaps to origins (5)\n**Orientation**: down", "explanation": "**Clue**: They’re found in returning perhaps to origins (5)\n**STEP 1**:\nWe can guess that the clue tells us that the answer is *returning* “PERHAPS TO ORIGINS”. The word “RETURNING” suggests that this puzzle is a Reversal type puzzle. That means we will first find the wordplay word to reverse, and then we will reverse the letter of it to get the answer. \nWe will start by identifying the type of the puzzle. We can guess that the clue tells us the answer is *found in* “RETURNING PERHAPS TO ORIGINS”. The phrase “FOUND IN” suggests that this puzzle is a Hidden Word type puzzle. That means the answer we need to find hides inside the concatenation of the words. We just need to concatenate words in the clue, and find the answer that hides inside of them.\nSo there are two types of puzzles in this clue: Reversal and Hidden Word. So our plan is to find the wordsplay phrase, reverse the letters in the wordplay phrase, and then find the answer that is hiding inside. \n**STEP 2**:\nWe will then find the definition. Although the definition is almost always either at the beginning or end of the clue sentence or phrase, we see that the clue is a clear description of something. So this may be a “&lit” typed puzzle, and the definition will overlap with the wordplay, in this case the definition can be the entire sentence: “THEY’RE FOUND IN RETURNING PERHAPS TO ORIGINS”. \n**STEP 3**: \nWe will look at the word length of the answer. The enumeration suggests that the answer will be one word that is 5 letters long. \n**STEP 4**: \nWe will solve the puzzle by following the plan we made in STEP 1: since “THEY’RE FOUND IN RETURNING PERHAPS TO ORIGINS” is the definition, and “RETURNING” is the indicator, then we probably should look at the rest of the sentence. \nFrom one direction, we see that the clue tells us *returning* “PERHAPS TO ORIGINS”: so we will concatenate it and reverse it to get “SNIGIROOTSPAHREP”. \nThen since “SNIGIROOTSPAHREP” is the wordplay phrase and the clue tells us the answer is *found in* “RETURNING PERHAPS TO ORIGINS”. The phrase “FOUND IN” is the indicator that it’s a Hidden type, we will scan the concatenate string with a ‘sliding window’ of 5 letters. (“SNIGI”, “NIGIR”, “IGIRO”, ……)\nIt's still not quite clear what the answer can be. Let’s think from another direction: If we think about it:\n1. The answer is something that “THEY’RE FOUND IN RETURNING PERHAPS TO ORIGINS”\n2. One word with 5 letters long: So we will just scan the concatenate string with a ‘sliding window’ of 5 letters. \n3. Likely to hide at the connection place of words.\nWe see that “ROOTS” in “SNIGI*ROOTS*PAHREP” stands out. And indeed, “ROOTS” fits into the definition “THEY’RE FOUND IN RETURNING PERHAPS TO ORIGINS”. \n**STEP 5**:  \nWe will check if the answer we found is correct. FIRST, it fits the enumeration, because “ROOTS” is indeed one word that is 5 letters long.  SECOND, The word “ROOTS” is a meaningful word and fits the definition “THEY’RE FOUND IN RETURNING PERHAPS TO ORIGINS”. \nSo the answer is **ROOTS**"}
{"clue": "The stuff collected by shaking duster? (8)", "orientation": "down", "quick": false, "input": "**Clue**: The stuff collected by shaking duster? (8)\n**Orientation**: down", "explanation": "**Clue**: The stuff collected by shaking duster? (8)\n**STEP 1**:\nWe can guess that the clue tells us *shaking* “DUSTER”. The word “SHAKING” suggests that this puzzle is an Anagram type puzzle. That means we need to shuffle the letters of the wordplay words to form the answer. The wordplay words to shuffle (the anagram fodder) can be word or phrase directly from the clue, or it could be indirect and cued by some words or phrase in the clue.\nWe can guess that the clue tells us “THE STUFF” *(is) collected by* “SHAKING DUSTER”. The word “COLLECTED BY” suggests that this puzzle is a Sandwich type puzzle. “BY” is probably a linkword. That means we need to find two sets of wordplay words, and we will split one wordplay word and stuff the other wordplay word inside of it to form the answer. In this case, the wordplay word of “THE STUFF” is probably *inside* the wordplay word we get from “SHAKING DUSTER”\nSo there are two types of puzzles in this clue: Anagram and Sandwich. So we can first solve the anagram part: *shaking* “DUSTER”, and then we find the wordplay word for “THE STUFF”, and finally we stuff “THE STUFF” inside “SHAKING DUSTER”. However, it is almost equivalent to first find both wordplay words, and get their letters, and then perform anagram on the letters. So that is what we are going to do. \n**STEP 2**:\nWe will then find the definition. Although the definition is almost always either at the beginning or end of the clue sentence or phrase, we see that the clue is a short sentence that is a clear description of something. And usually the clue ends in “?”, which is a common indicator for a “&lit” type puzzle. So this may be a “&lit” typed puzzle, and the definition will overlap with the wordplay, in this case the definition can be the entire sentence: “THE STUFF COLLECTED BY SHAKING DUSTER?”. \n**STEP 3**: \nWe will look at the word length of the answer. The enumeration suggests that the answer will be one word that is 8 letters long. \n**STEP 4**: \nWe will solve the puzzle by following the plan we made in STEP 1: \nSince it’s a Sandwich type puzzle, we will first find the two sets of wordplay words. \n“THE STUFF” could cue “IT”, because “THE STUFF” means “IT”. We can probably take “DUSTER” as it is. So we have “DUSTER IT” with letters “D U S T E R I T”.\nIt's still not quite clear what the answer can be. Let’s think from another direction: If we think about it:\n1. The answer is “THE STUFF COLLECTED BY SHAKING DUSTER?” \n2. The answer is one word 8 letters long\n3. We have letters “D U S T E R I T” to perform anagram.\nwe would think about the word “DETRITUS”. which fits the definition “THE STUFF COLLECTED BY SHAKING DUSTER”. \n**STEP 5**:  \nWe will check if the answer we found is correct. FIRST, it fits the enumeration, because “DETRITUS” is indeed one word with 8 letters.  SECOND, The word “DETRITUS” is a meaningful word and fits the definition “THE STUFF COLLECTED BY SHAKING DUSTER”. \nSo the answer is **DETRITUS**"}
{"clue": "Festive occasion was put on canvas (7)", "orientation": "down", "quick": false, "input": "**Clue**: Festive occasion was put on canvas (7)\n**Orientation**: down", "explanation": "**Clue**: Festive occasion was put on canvas (7)\n**STEP 1**: \nWe will start by identifying the type of the puzzle. We guess that the clue tells us “WAS” *put on* “CANVAS”. Since it is a *down* type clue, the phrase “PUT ON” suggests that it is a Charade (additive) type of puzzle. That means we need to find wordplay words from words or phrases in the clue, and concatenate the wordplay words together. \n**STEP 2**: \nWe will then find the definition. Since the definition is almost always either at the beginning or end of the clue sentence or phrase, we will assume “FESTIVE OCCASION” is the definition. \n**STEP 3**: \nWe will look at the word length of the answer. The enumeration suggests that the answer will be one word that is 7 letters long. \n**STEP 4**: \nWe will solve the puzzle by following the plan we made in STEP 1: since it’s a Charade type puzzle, we will try to find the wordplay words that each phrase in the puzzle cues. Since the clue tells us “WAS” *put on* “CANVAS”, we just need to find what “WAS” and “CANVAS” cue. \nIf we take “WAS” as it is:\nIt's still not quite clear what the answer can be. Let’s think from another direction: If we think about it:\n1. The answer is related to “FESTIVE OCCASION” \n2. The answer is one word with 7 letters\n3. The answer starts with “WAS”\nwe would think about the word “WASSAIL”. Which is “WAS” + “SAIL”. And indeed, “CANVAS” reasonably cues “SAIL”. \nTo conclude: we take “WAS” as it is, and “CANVAS” cues “SAIL”, then we have “WASSAIL”, which is a beverage made for a “FESTIVE OCCASION”\n**STEP 5**:  \nWe will check if the answer we found is correct. FIRST, it fits the enumeration, because “WASSAIL” is indeed one word with 7 letters. SECOND, the word “WASSAIL” is a meaningful word and fits the definition “FESTIVE OCCASION”. \nSo the answer is **WASSAIL**"}
{"clue": "What’s made only to snap in bits? (7, 6)", "orientation": "across", "quick": false, "input": "**Clue**: What’s made only to snap in bits? (7, 6)\n**Orientation**: across", "explanation": "**Clue**: What’s made only to snap in bits? (7, 6)\n**STEP 1**: \nWe will start by identifying the type of the puzzle. We cannot find any indicators for this clue, we assume that it is a Cryptic Definition type of puzzle. We will plan what to do: This seems like a question, so we will straightforwardly think of the answer. \n**STEP 2**: \nWe will then find the definition. Although the definition is almost always either at the beginning or end of the clue sentence or phrase, we see that the clue is a short sentence that is a clear description of something. And usually the clue ends in “?”, which is a common indicator for a “&lit” type puzzle. So this may be a “&lit” typed puzzle, and the definition will overlap with the wordplay, in this case the definition can be the entire sentence: “WHAT’S MADE ONLY TO SNAP IN BITS?”. \n**STEP 3**: \nWe will look at the word length of the answer. The enumeration suggests that the answer will be two words, 7 and 6 letters long each.\n**STEP 4**: \nWe will solve the puzzle by following the plan we made in STEP 1: \nWhen we look at the clue, “BITS” means binary digits, something related to the computer. \nWe need to find a phrase that could satisfies: \n1. Answers the question “WHAT’S MADE ONLY TO SNAP IN BITS?”\n2. Two words, 7 and 6 letters long each\n3. Something that relates to computer\nWe can think of the word “DIGITAL CAMERA”, which is “WHAT’S MADE ONLY TO SNAP IN BITS”. \n**STEP 5**:  \nWe will check if the answer we found is correct. FIRST, it fits the enumeration, because “DIGITAL CAMERA” is indeed two words, 7 and 6 letters long each. SECOND, the word “two words, 7 and 6 letters long each.” is a meaningful word and fits the definition “WHAT’S MADE ONLY TO SNAP IN BITS”. \nSo the answer is **DIGITAL CAMERA**"}
{"clue": "Responsibility for tax (4)", "orientation": "across", "quick": false, "input": "**Clue**: Responsibility for tax (4)\n**Orientation**: across", "explanation": "**Clue**: Responsibility for tax (4)\n**STEP 1**:\nWe will start by identifying the type of the puzzle. We see that the clue can be separated into two reasonable descriptions of something, although there are 3 words in the clue, “FOR” is probaby a linkword, so there are two separate words left in the clue. This can be a scheme for Double Definition with linkwords. So I assume that this is a Double Definition type puzzle. That means we need to find the answer that simultaneously satisfies both definition, and the enumeration field. \n**STEP 2**:\nWe will then find the definition. Although the definition is almost always either at the beginning or end of the clue sentence or phrase, we see that the clue can be separated into two reasonable descriptions of something. Considering “FOR” is the linkword, the two definitions are: Definition 1 is “RESPONSIBILITY”, definition 2 is “TAX”. \n**STEP 3**: \nWe will look at the word length of the answer. The enumeration suggests that the answer will be one word that is 4 letters long. \n**STEP 4**: \nWe will solve the puzzle by following the plan we made in STEP 1: We know that the answer need to satisfy three constraints:\n1. It must fit definition 1: “RESPONSIBILITY”\n2. It must fit definition 2: “TAX”. \n3. It must be one word that is 4 letters long. \nSo we can think of the word “DUTY”. Because “RESPONSIBILITY” can cue the word “DUTY” and “TAX” can also cue the word “DUTY”. \n**STEP 5**:  \nWe will check if the answer we found is correct. FIRST, it fits the enumeration, because “DUTY” is indeed one word with 4 letters.  SECOND, The word “DUTY” is a meaningful word and fits the definition “RESPONSIBILITY” and “TAX”. \nSo the answer is **DARTS**"}
